kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
static inline uint8_t vnd_frame_pace_applies(void)
{
#if VND_USB_FRAME_PACE_MS > 0
    if(!streaming || diag_mode_active) return 0u;
    /* AVG_ROI is already rate-limited by buf_rate / avg_n. Extra USB pacing
       throttles avg_n=8/16 below their expected 50/25 fps and delays B after A. */
    return (vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI) ? 1u : 0u;
#else
    return 0u;
#endif
}

static inline uint8_t vnd_frame_pace_ready(uint32_t now_ms)
{
    if(!vnd_frame_pace_applies()) return 1u;
#if VND_USB_AFTER_HOST_ACK_PACE_MS > 0
    if(vnd_last_host_rx_ack_ms != 0u){
        uint32_t ack_age_ms = 0u;
        if(vnd_tick_age_ms(now_ms, vnd_last_host_rx_ack_ms, &ack_age_ms) &&
           ack_age_ms < (uint32_t)VND_USB_AFTER_HOST_ACK_PACE_MS){
            return 0u;
        }
    }
#endif
    if(vnd_next_frame_tx_ms == 0u) return 1u;
    return ((int32_t)(now_ms - vnd_next_frame_tx_ms) >= 0) ? 1u : 0u;
}

static inline void vnd_frame_pace_arm(uint32_t now_ms)
{
    if(vnd_frame_pace_applies()){
        vnd_next_frame_tx_ms = now_ms + (uint32_t)VND_USB_FRAME_PACE_MS;
    }
}

/* stream_mode=2: усреднение ROI по N буферам, раздельно для even/odd. */
static volatile uint8_t vnd_avg_n = 24; /* 8..64 (рабочие значения: 8/16/24/32/40/48/56/64) */
static uint8_t vnd_avg_cnt[2] = {0,0};
static uint8_t vnd_avg_next_parity = 0; /* 0=even, 1=odd (legacy; не используется для выпуска кадров) */
static uint32_t vnd_avg_last_dma_seq[2] = {0,0};
static uint32_t vnd_avg_last_ts_ms[2] = {0,0};
static uint32_t vnd_avg_sum[2][2][MAX_FRAME_SAMPLES]; /* [parity][ch][i] */
static __attribute__((unused)) uint16_t vnd_avg_out[2][MAX_FRAME_SAMPLES];    /* [ch][i] */

/* Диагностика stream_mode=2: сколько входных кадров съели / сколько усреднённых выпустили */
static volatile uint32_t dbg_avg_in_frames = 0;
static volatile uint32_t dbg_avg_out_frames = 0;
static volatile uint32_t dbg_avg_tx_pairs = 0;
static uint32_t dbg_avg_last_print_ms = 0;
static uint32_t dbg_avg_in_last = 0, dbg_avg_out_last = 0, dbg_avg_tx_last = 0;

/* DC: параметры */
#ifndef VND_DC_ROI_LEN
#define VND_DC_ROI_LEN 200u
#endif
#ifndef VND_DC_RANGE_THRESHOLD
#define VND_DC_RANGE_THRESHOLD ((uint32_t)(65535u * 99u / 100u)) /* 99% полной шкалы */
#endif

/* Шаг просмотра при оценке размаха (mx-mn) на сыром буфере.
    Для низкочастотного сигнала можно ставить 4, чтобы уменьшить нагрузку CPU.
    1 = проверять каждый семпл (самое надёжное). */
#ifndef VND_DC_RANGE_STRIDE
#define VND_DC_RANGE_STRIDE 4u
#endif
#ifndef VND_DC_SAVE_PERIOD_MS
#define VND_DC_SAVE_PERIOD_MS (0u) /* отключено: сохранение только по команде хоста (0x2B) */
#endif
#ifndef VND_DC_SAVE_PERIOD_FIRST_MS
#define VND_DC_SAVE_PERIOD_FIRST_MS (0u) /* отключено: сохранение только по команде хоста (0x2B) */
#endif

/* После загрузки DC из Flash первые кадры могут быть нестабильны (старт ADC/аналоговой части).
    Чтобы не «переписать» только что восстановленное состояние, временно блокируем адаптацию,
    но продолжаем ПРИМЕНЯТЬ DC сразу. */
#ifndef VND_DC_ADAPT_HOLDOFF_MS
#define VND_DC_ADAPT_HOLDOFF_MS (2000u)
#endif

/* Time-based DC SAR adaptation. Host-visible units are milliseconds; host UI can show seconds.
    Значения трактуются как время полного прохода 16 SAR-битов к целевому уровню 32767:
    larger value means slower tracking. */
#ifndef VND_DC_WORK_SETTLE_MS
#define VND_DC_WORK_SETTLE_MS   (15u*60u*1000u) /* 900 s */
#endif
#ifndef VND_DC_DETECT_SETTLE_MS
#define VND_DC_DETECT_SETTLE_MS (60u*1000u)     /* 60 s */
#endif
#ifndef VND_DC_FAST_SETTLE_MS
#define VND_DC_FAST_SETTLE_MS   (5u*1000u)      /* 5 s */
#endif
#ifndef VND_DC_SETTLE_MIN_MS
#define VND_DC_SETTLE_MIN_MS    (1u)
#endif
#ifndef VND_DC_SETTLE_MAX_MS
#define VND_DC_SETTLE_MAX_MS    (24u*60u*60u*1000u)
#endif
#ifndef VND_DC_ADAPT_DT_MAX_MS
#define VND_DC_ADAPT_DT_MAX_MS  (1000u)
#endif

/* За settle_ms выполняется полный 16-битный SAR-проход. При очень малом settle_ms
    бюджет набирает все биты за один кадр, что даёт максимально быструю адаптацию. */
#ifndef VND_DC_SAR_BITS
#define VND_DC_SAR_BITS (16u)
#endif
#ifndef VND_DC_SAR_MAX_BITS_PER_UPDATE
#define VND_DC_SAR_MAX_BITS_PER_UPDATE (16u)
#endif

/* Deadband для адаптации DC вокруг midscale.
    Без deadband даже при правильном DC из-за шума знак (v-32767) будет часто меняться,
    что приводит к "random walk" (постоянно dirty и ощущение, что после reboot всё заново).
    Значение в LSB. */
#ifndef VND_DC_DEADBAND
#define VND_DC_DEADBAND 16u
#endif

/* ВНИМАНИЕ: адрес Flash должен быть вне области прошивки.
   Мы резервируем последний сектор через линкер (см. STM32H723VGTX_FLASH.ld).
   Для 1MB FLASH: база последнего сектора = 0x080E0000 (128KB сектор №7). */
#ifndef VND_DC_FLASH_ADDR
#define VND_DC_FLASH_ADDR 0x080E0000u
#endif

#define VND_DC_MAGIC 0x31434456u /* 'V''D''C''1' little-endian */
/* ver=3: commit marker in _pad[] makes partially written slots uncommitted. */
#define VND_DC_VER   3u

typedef struct __attribute__((packed)) {
    uint32_t magic;
    uint16_t ver;
    uint16_t roi_len; /* ожидаем 200 */
    uint32_t write_counter;
    uint16_t crc16; /* CRC16-CCITT по полю data[] */
    uint16_t _rsv0;

    int16_t  dc[2][2][VND_DC_ROI_LEN]; /* [ch][parity][i] signed offset */
    uint8_t  pos[2][2];
    uint8_t  _pad[32]; /* запас/выравнивание; точный размер не критичен */
} vnd_dc_blob_t;

/* Flash layout: append-only journal inside the reserved 128KB sector.
   This avoids long sector erase on every save (which can stall USB/main loop).
   We erase the sector only when it becomes full or journal tail is corrupted.
   Slot size must be multiple of 32 bytes for FLASHWORD programming. */
#define VND_DC_FLASH_SECTOR_SIZE (0x20000u)
#define VND_DC_SLOT_SIZE         (((uint32_t)sizeof(vnd_dc_blob_t) + 31u) & ~31u)
#define VND_DC_COMMIT_MAGIC      0x21434456u /* 'VDC!' little-endian */
#define VND_DC_COMMIT_OFFSET     ((uint32_t)offsetof(vnd_dc_blob_t, _pad) + 28u)
#define VND_DC_RECOVERY_MAGIC    0x44524356u /* 'VCRD' little-endian */

#ifndef VND_DC_SAVE_DRY_RUN
#define VND_DC_SAVE_DRY_RUN      0u
#endif

#ifndef VND_DC_SAVE_UNLOCK_TEST
#define VND_DC_SAVE_UNLOCK_TEST  0u
#endif

