kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
static void vnd_sync_set_slave(void)
{
    /* TIM5 как 32-битный счётчик фазы: запускается базовым таймером в main.c */
    vnd_sync_capture_valid = 0;
}

static void vnd_sync_apply_mode(uint8_t mode)
{
    extern volatile uint8_t g_arr_manual_mode;

    if(mode > VND_SYNC_MODE_OFF) mode = VND_SYNC_MODE_MASTER;

    if (mode == VND_SYNC_MODE_MASTER || mode == VND_SYNC_MODE_SLAVE) {
        adc_stream_clear_buf_rate_override();
    }

    vnd_sync_mode = mode;
    {
        extern volatile uint8_t sync_edge_seen;
        extern volatile uint32_t sync_last_edge_ms;
        extern TIM_HandleTypeDef htim5;
        extern volatile uint8_t sync_align_pending;
        extern volatile uint8_t sync_phase_lock_armed;
        extern volatile uint8_t sync_phase_lock_active;
        extern volatile uint8_t sync_restart_on_edge;
        sync_edge_seen = 0u;
        sync_last_edge_ms = 0u;
        htim5.Instance->CNT = 0u;
        sync_align_pending = 0u;
        sync_phase_lock_armed = 0u;
        sync_phase_lock_active = 0u;
        sync_restart_on_edge = 0u;
    }
    if(mode == VND_SYNC_MODE_MASTER){
        vnd_sync_mode_public = VND_SYNC_MODE_MASTER;
        vnd_sync_set_master(0u);
        vnd_sync_ok_public = 1u;
    } else if(mode == VND_SYNC_MODE_SLAVE){
        extern volatile uint8_t sync_align_pending;
        extern volatile uint8_t sync_phase_lock_armed;
        extern volatile uint8_t sync_restart_on_edge;
        vnd_sync_mode_public = VND_SYNC_MODE_SLAVE;
        vnd_sync_set_slave();
        vnd_sync_ok_public = 0u;
        vnd_sync_start_tim5_base();
        if (g_arr_manual_mode) {
            sync_align_pending = 0u;
            sync_phase_lock_armed = 0u;
            sync_restart_on_edge = 0u;
        } else {
            sync_align_pending = 1u;
            sync_phase_lock_armed = 1u;
            sync_restart_on_edge = 1u;
        }
    } else {
        vnd_sync_mode_public = VND_SYNC_MODE_OFF;
        vnd_sync_ok_public = 0u;
    }
    vnd_sync_pending_hz = 0u;
    vnd_sync_last_capture_ms = 0u;
    vnd_sync_last_apply_ms = 0u;
    HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);
    vnd_adc_restart_request = 1u;
    cdc_logf("EVT SYNC_MODE APPLY mode=%u", (unsigned)mode);
}

void vnd_sync_set_mode_auto(uint8_t mode)
{
    if (vnd_sync_mode_host_forced) {
        return;
    }
    vnd_sync_apply_mode(mode);
}

static void vnd_sync_apply_host_forced_mode(uint8_t mode)
{
    if(mode > VND_SYNC_MODE_OFF) mode = VND_SYNC_MODE_MASTER;

    vnd_sync_mode_host_forced = 1u;
    if (mode == VND_SYNC_MODE_MASTER || mode == VND_SYNC_MODE_SLAVE) {
        /* A host-selected topology must be renumbered by the selected master.
           Clear any previous compact slave id on every forced MASTER/SLAVE
           command; slaves will fall back to UID-hint and then accept fresh
           compact assignment from the new master. */
        rs485_set_local_node_id_from_host(0u);
    }
    vnd_sync_apply_mode(mode);
}

/* Принудительная установка режима (не блокируется флагом host_forced) */
void vnd_sync_apply_mode_forced(uint8_t mode)
{
    vnd_sync_apply_host_forced_mode(mode);
}

/* Снятие принудительного режима, возврат к автоматическому */
void vnd_sync_release_host_forced(void)
{
    vnd_sync_mode_host_forced = 0u;
}

uint8_t vnd_sync_is_mode_host_forced(void)
{
    return vnd_sync_mode_host_forced;
}

__attribute__((unused))
static uint16_t vnd_dc_bank_crc16(uint8_t ch, uint8_t parity)
{
    if(ch > 1u || parity > 1u) return 0;
    return vnd_crc16_ccitt((const uint8_t*)vnd_dc_buf[ch][parity], (uint32_t)sizeof(vnd_dc_buf[ch][parity]));
}

static uint32_t vnd_dc_score_bank(const uint16_t *raw, uint16_t raw_ns, uint16_t roi_start, uint16_t roi_len, uint8_t ch, uint8_t parity)
{
    if(!raw) return 0xFFFFFFFFu;
    if(ch > 1u || parity > 1u) return 0xFFFFFFFFu;
    if(roi_len != (uint16_t)VND_DC_ROI_LEN) return 0xFFFFFFFFu;
    if(raw_ns < (uint16_t)(roi_start + roi_len)) return 0xFFFFFFFFu;

    /* Скоринг: весь ROI (200 точек). Это выполняется редко (один раз после reboot),
       поэтому лучше быть надёжным, чем быстрым. */
    uint32_t acc = 0;
    for(uint16_t i = 0; i < roi_len; i++){
        uint16_t v = raw[roi_start + i];
        int16_t dc = vnd_dc_buf[ch][parity][i];
        int32_t y = (int32_t)v + (int32_t)dc;
        int32_t e = y - 32767;
        if(e < 0) e = -e;
        acc += (uint32_t)e;
    }
    return acc;
}

static inline void vnd_invalidate_dcache_range(uint32_t addr, uint32_t len)
{
#if (VND_ENABLE_CACHE_INVALIDATE && (__DCACHE_PRESENT == 1U))
    if(len == 0u) return;
    uint32_t a0 = addr & ~31u;
    uint32_t a1 = (addr + len + 31u) & ~31u;
    uint32_t alen = a1 - a0;
    SCB_InvalidateDCache_by_Addr((uint32_t*)a0, (int32_t)alen);
#else
    (void)addr; (void)len;
#endif
}

static inline uint8_t vnd_raw_has_full_swing_u16(const uint16_t *p, uint16_t n, uint32_t threshold)
{
    if(!p || n == 0u) return 0u;
    uint16_t mn = 0xFFFFu;
    uint16_t mx = 0u;

    uint16_t step = (uint16_t)VND_DC_RANGE_STRIDE;
    if(step == 0u) step = 1u;

    for(uint16_t i=0;i<n;i=(uint16_t)(i+step)){
        uint16_t v = p[i];
        if(v < mn) mn = v;
        if(v > mx) mx = v;
        if((uint32_t)(mx - mn) > threshold) return 1u; /* экономим CPU: дальше не проверяем */
    }
    return 0u;
}

/* Background DC maintenance (always-on, independent of stream_mode).
   Uses raw ADC latest FIFO frame (peek) to decide whether the signal is too dynamic/saturated
   for learning, then applies+adapts DC on ROI.
   NOTE: threshold is swing (max-min), not absolute level.
   IMPORTANT: uses peek API so it does NOT consume FIFO frames used for USB streaming. */
static void vnd_dc_background_step(uint16_t roi_start, uint16_t roi_len)
{
    /* Обязательно загрузить DC из Flash как можно раньше после reboot,
       даже если окно пока не выставлено в 200. */
    vnd_dc_load_once();
    if(roi_len == 0u) return;
    if(roi_len != (uint16_t)VND_DC_ROI_LEN) return;

     /* Обновляемся на каждом новом FIFO-кадре; скорость обучения задаёт host через settle_ms. */
    static uint32_t last_seq = 0xFFFFFFFFu;

    uint16_t *a_ptr = NULL, *b_ptr = NULL; uint16_t ns = 0; uint32_t dma_seq = 0;
    if(!adc_peek_latest_frame_pair_fifo(&a_ptr, &b_ptr, &ns, &dma_seq)){
        return;
    }
    if(dma_seq == last_seq) return;
    last_seq = dma_seq;
    if(!a_ptr || !b_ptr) return;
    if(ns < (uint16_t)(roi_start + roi_len)){
        return;
    }

    uint32_t now_ms = HAL_GetTick();

    uint8_t parity = (uint8_t)(adc_get_buffer_parity(dma_seq) & 1u);
    uint16_t check_n = ns;
    if(check_n > 600u) check_n = 600u;

