kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    if(best == NULL){
        VND_DC_LOGF("[DC] LOAD EMPTY (journal)\r\n");
        memset(vnd_dc_buf, 0, sizeof(vnd_dc_buf));
        memset(vnd_dc_pos, 0, sizeof(vnd_dc_pos));
        vnd_dc_adapt_block_until_ms = HAL_GetTick() + (uint32_t)VND_DC_ADAPT_HOLDOFF_MS;
        vnd_dc_dirty = 0;
        vnd_dc_dirty_public = 0;
        vnd_dc_dirty_since_ms = 0;
        vnd_dc_write_counter = 0;
        vnd_dc_write_counter_public = 0;
        vnd_dc_load_flags_public = 0;
        vnd_dc_loaded_crc16_public = 0;
        vnd_dc_last_save_ms = HAL_GetTick();
        vnd_dc_reset_adapt_state();
        return;
    }

    memcpy(vnd_dc_buf, best->dc, sizeof(vnd_dc_buf));
    memcpy(vnd_dc_pos, best->pos, sizeof(vnd_dc_pos));
    vnd_dc_reset_adapt_state();
    vnd_dc_parity_swap_valid = 0u; /* пересчитаем после загрузки на первом кадре */
    vnd_dc_write_counter = best->write_counter;
    vnd_dc_write_counter_public = vnd_dc_write_counter;
    vnd_dc_load_flags_public = (uint8_t)(1u | (need_erase ? 2u : 0u));
    vnd_dc_loaded_crc16_public = best->crc16;
    vnd_dc_dirty = 0;
    vnd_dc_dirty_public = 0;
    vnd_dc_dirty_since_ms = 0;
    vnd_dc_adapt_block_until_ms = HAL_GetTick() + (uint32_t)VND_DC_ADAPT_HOLDOFF_MS;
    vnd_dc_last_save_ms = HAL_GetTick();
        VND_DC_LOGF("[DC] LOAD OK (journal): cnt=%lu next_off=%lu%s\r\n",
           (unsigned long)vnd_dc_write_counter,
           (unsigned long)vnd_dc_flash_next_off,
           need_erase ? " ERASE_PENDING" : "");

        VND_DC_LOGF("[DC] ADAPT_HOLDOFF: %lu ms\r\n", (unsigned long)(uint32_t)VND_DC_ADAPT_HOLDOFF_MS);

        /* Печатаем контрольные суммы 4 массивов DC (канал×parity), чтобы руками сравнить до/после reboot. */
        VND_DC_LOGF("[DC] BANK CRC16: A0=%04X A1=%04X B0=%04X B1=%04X\r\n",
            (unsigned)vnd_dc_bank_crc16(0u,0u), (unsigned)vnd_dc_bank_crc16(0u,1u),
            (unsigned)vnd_dc_bank_crc16(1u,0u), (unsigned)vnd_dc_bank_crc16(1u,1u));
}

static void vnd_dc_try_save_periodic(void)
{
    uint8_t manual_save = 0u;
    if(vnd_dc_save_request){
        vnd_dc_save_request = 0u;
        manual_save = 1u;
    }
    if(vnd_dc_auto_freeze && !manual_save) return; /* auto-freeze: no saving while signal is too dynamic/saturated */
    /* Привязываем период к моменту, когда DC стал dirty (и к LCD-прогрессу).
       Это устраняет ситуацию, когда прогресс дошёл до конца, а попытка save не делается.
       Условие: если dirty и прошло >= period с dirty_since_ms — пытаемся писать.
       При FAIL: НЕ очищаем dirty, но перезапускаем отсчёт (следующая попытка через period).
       При OK: очищаем dirty и сбрасываем dirty_since_ms.
     */
    if(!manual_save && !vnd_dc_dirty_public) return;
    if(!manual_save && !vnd_dc_dirty) return;
    uint32_t now = HAL_GetTick();
    uint32_t period = (vnd_dc_write_counter == 0u)
                      ? (uint32_t)VND_DC_SAVE_PERIOD_FIRST_MS
                      : (uint32_t)VND_DC_SAVE_PERIOD_MS;
    vnd_dc_save_period_ms = period;
    if(!manual_save && period == 0u) return;
    if(!manual_save && vnd_dc_dirty_since_ms == 0u){
        vnd_dc_dirty_since_ms = now;
        return;
    }
    if(!manual_save && (now - vnd_dc_dirty_since_ms) < period) return;

    vnd_dc_blob_t blob;
    memset(&blob, 0, sizeof(blob));
    blob.magic = VND_DC_MAGIC;
    blob.ver = (uint16_t)VND_DC_VER;
    blob.roi_len = (uint16_t)VND_DC_ROI_LEN;
    blob.write_counter = ++vnd_dc_write_counter;
    vnd_dc_write_counter_public = vnd_dc_write_counter;
    memcpy(blob.dc, vnd_dc_buf, sizeof(vnd_dc_buf));
    memcpy(blob.pos, vnd_dc_pos, sizeof(vnd_dc_pos));
    vnd_dc_blob_set_commit(&blob);
    uint32_t data_off = (uint32_t)offsetof(vnd_dc_blob_t, dc);
    uint32_t data_len = (uint32_t)sizeof(blob.dc) + (uint32_t)sizeof(blob.pos);
    blob.crc16 = vnd_crc16_ccitt(((const uint8_t*)&blob) + data_off, data_len);

     /* Диагностика: контрольные суммы 4 DC массивов в RAM на момент сохранения.
         Это позволяет сравнить с тем, что загрузится после reboot. */
    VND_DC_LOGF("[DC] SAVE BANK CRC16: A0=%04X A1=%04X B0=%04X B1=%04X\r\n",
              (unsigned)vnd_dc_bank_crc16(0u,0u), (unsigned)vnd_dc_bank_crc16(0u,1u),
              (unsigned)vnd_dc_bank_crc16(1u,0u), (unsigned)vnd_dc_bank_crc16(1u,1u));

#if VND_DC_SAVE_DRY_RUN
    vnd_dc_dirty = 0;
    vnd_dc_dirty_public = 0;
    vnd_dc_dirty_since_ms = 0;
    vnd_dc_last_save_ms = now;
    vnd_dc_save_ok_count++;
    vnd_dc_save_last_result = 1;
    vnd_dc_save_last_ms = now;
    vnd_dc_loaded_crc16_public = blob.crc16;
    VND_DC_LOGF("[DC] SAVE DRYRUN OK: cnt=%lu crc=0x%04X\r\n",
           (unsigned long)vnd_dc_write_counter, (unsigned)blob.crc16);
    return;
#endif

    /* Запись во Flash: journal append. Стираем сектор ТОЛЬКО когда он заполнится/повреждён. */
    HAL_StatusTypeDef unlock_st = HAL_FLASH_Unlock();
    if(unlock_st != HAL_OK){
        uint32_t err = 0;
#if defined(HAL_FLASH_GetError)
        err = HAL_FLASH_GetError();
#endif
        vnd_dc_save_last_err = err;
        vnd_dc_save_fail_count++;
        vnd_dc_save_last_result = 2;
        vnd_dc_save_last_ms = now;
        vnd_dc_dirty_since_ms = now;
        VND_DC_LOGF("[DC] SAVE FAIL: unlock st=%lu err=0x%08lX\r\n",
               (unsigned long)unlock_st, (unsigned long)err);
        return;
    }
    /* HAL версии отличаются по именам флагов ошибок. */
#if defined(FLASH_FLAG_ALL_ERRORS)
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS);
#elif defined(FLASH_FLAG_ALL_ERRORS_BANK1)
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS_BANK1);
    #if defined(FLASH_FLAG_ALL_ERRORS_BANK2)
        __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS_BANK2);
    #endif
#else
    /* Fallback: ничего не чистим явно */
#endif

#if VND_DC_SAVE_UNLOCK_TEST
    {
        uint32_t err = 0;
#if defined(HAL_FLASH_GetError)
        err = HAL_FLASH_GetError();
#endif
        vnd_dc_save_last_err = err;
        HAL_FLASH_Lock();
        vnd_dc_dirty = 0;
        vnd_dc_dirty_public = 0;
        vnd_dc_dirty_since_ms = 0;
        vnd_dc_last_save_ms = now;
        vnd_dc_save_ok_count++;
        vnd_dc_save_last_result = 1;
        vnd_dc_save_last_ms = now;
        vnd_dc_loaded_crc16_public = blob.crc16;
        VND_DC_LOGF("[DC] SAVE UNLOCK_TEST OK: cnt=%lu err=0x%08lX crc=0x%04X\r\n",
               (unsigned long)vnd_dc_write_counter, (unsigned long)err, (unsigned)blob.crc16);
        return;
    }
#endif

            /* Определяем bank/sector по адресу (STM32H723, 1MB FLASH, 128KB sectors).
               В этом проекте DC хранится в 0x080E0000..0x080FFFFF, это ГЛОБАЛЬНЫЙ сектор #7.
               Устройство dual-bank: Bank1 содержит сектора 0..3, Bank2 содержит сектора 4..7. */
            uint32_t erase_bank = FLASH_BANK_1;
            uint32_t erase_sector = 0;
            {
                uint32_t addr = (uint32_t)VND_DC_FLASH_ADDR;
                uint32_t rel = addr - 0x08000000u;
                uint32_t sec_global = rel / 0x20000u; /* 128KB */
                if(sec_global > 7u) sec_global = 7u;

            #if defined(FLASH_BANK_2)
                if(sec_global >= 4u) erase_bank = FLASH_BANK_2;
            #endif

            #if defined(FLASH_SECTOR_0)
                erase_sector = (uint32_t)FLASH_SECTOR_0 + sec_global;
            #else
                erase_sector = sec_global;
            #endif
            }

    /* Сохраним, что именно использовали (для LCD/диагностики) */
    vnd_dc_save_last_bank = erase_bank;
    vnd_dc_save_last_sector = erase_sector;
    vnd_dc_save_last_sector_error = 0;
    vnd_dc_save_last_err = 0;

    /* Determine write offset. If sector is full/corrupted, erase once and restart from 0. */
    uint32_t write_off = vnd_dc_flash_next_off;
    if(write_off > (VND_DC_FLASH_SECTOR_SIZE - VND_DC_SLOT_SIZE)){
#if !VND_DC_SAVE_ERASE_ENABLE
        vnd_dc_save_last_err = 0;
        vnd_dc_save_fail_count++;
        vnd_dc_save_last_result = 2;
        vnd_dc_save_last_ms = now;
        vnd_dc_dirty_since_ms = now;
        VND_DC_LOGF("[DC] SAVE SKIP: erase disabled next_off=%lu\r\n",
               (unsigned long)write_off);
        HAL_FLASH_Lock();
        return;
#else
        FLASH_EraseInitTypeDef e;
        uint32_t sector_error = 0;
        memset(&e, 0, sizeof(e));
        e.TypeErase = FLASH_TYPEERASE_SECTORS;
        e.Banks = erase_bank;
        e.Sector = erase_sector;
        e.NbSectors = 1;
        if(HAL_FLASHEx_Erase(&e, &sector_error) != HAL_OK){
            uint32_t err = 0;
#if defined(HAL_FLASH_GetError)
            err = HAL_FLASH_GetError();
#endif
            vnd_dc_save_last_err = err;
            vnd_dc_save_last_sector_error = sector_error;
            vnd_dc_save_fail_count++;
            vnd_dc_save_last_result = 2;
            vnd_dc_save_last_ms = now;
                 VND_DC_LOGF("[DC] SAVE FAIL: erase(full) bank=%lu sector=%lu err=0x%08lX sec_err=%lu\r\n",
                   (unsigned long)erase_bank, (unsigned long)erase_sector, (unsigned long)err, (unsigned long)sector_error);
            HAL_FLASH_Lock();
            /* Не сбрасываем dirty. Перезапускаем отсчёт до следующей попытки. */
            vnd_dc_dirty_since_ms = now;
            return;
        }
        write_off = 0;
        vnd_dc_flash_next_off = 0;
    #if VND_DC_SAVE_ERASE_ONLY_TEST
        vnd_dc_flash_next_off_public = 0;
        vnd_dc_dirty = 0;
        vnd_dc_dirty_public = 0;
        vnd_dc_dirty_since_ms = 0;
        vnd_dc_last_save_ms = now;
        vnd_dc_save_ok_count++;
        vnd_dc_save_last_result = 1;
        vnd_dc_save_last_ms = now;
        vnd_dc_load_flags_public = 0u;
        HAL_FLASH_Lock();
        VND_DC_LOGF("[DC] SAVE ERASE_TEST OK: bank=%lu sector=%lu\r\n",
               (unsigned long)erase_bank, (unsigned long)erase_sector);
        return;
    #endif
#endif
    }

