kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    /* Дополнительно вывод в UART для отладки */
    if (last_cmd_received == 0x20) {
        printf("[CMD_IND] START received #%lu (at t=%lu ms, %lu sec ago)\r\n",
               (unsigned long)cmd_start_count, (unsigned long)last_cmd_timestamp_ms, (unsigned long)elapsed_sec);
        printf("[CMD_IND] START cfg: stream_mode=%u avg_n=%u async=%u chmode=%u\r\n",
               (unsigned)vnd_stream_mode, (unsigned)vnd_avg_n, (unsigned)async_mode, (unsigned)vnd_ch_mode);
    } else if (last_cmd_received == 0x21) {
        printf("[CMD_IND] STOP received #%lu (at t=%lu ms, %lu sec ago)\r\n",
               (unsigned long)cmd_stop_count, (unsigned long)last_cmd_timestamp_ms, (unsigned long)elapsed_sec);
    }
}

static void vnd_update_lcd_params(void)
{
    /* Частота блоков (пар кадров A+B): в FULL берём из периода пары, в DIAG — diag_hz */
    uint16_t block_hz = 0;
    if(full_mode) {
        uint16_t pp = vnd_pair_period_ms;
        block_hz = (pp > 0) ? (uint16_t)(1000u / pp) : 0u;
    } else {
        block_hz = diag_hz;
    }

    /* Кол-во сэмплов на канал в кадре: если явно задано командой — используем его, иначе активное */
    uint16_t frame_samples = (vnd_frame_samples_req != 0) ? vnd_frame_samples_req
                                : ((cur_samples_per_frame != 0) ? cur_samples_per_frame
                                                                : adc_stream_get_active_samples());

    /* Обновить LCD (только при изменениях внутри функции отображения) */
    // stream_display_update_host_params(
    //     host_profile,
    //     frame_samples,
    //     block_hz,
    //     win_start0, win_len0,
    //     win_start1, win_len1,
    //     (uint8_t)full_mode
    // );

    /* stream_display_update_host_params() сейчас выключен; подавляем -Werror по локальным метрикам */
    (void)block_hz;
    (void)frame_samples;
}

static void vnd_log_dc_cmd_rx(const uint8_t *data, uint32_t len)
{
    if(data == NULL || len == 0u) return;

    uint8_t cmd = data[0];
    if(cmd != VND_CMD_SET_DC_ADAPT &&
       cmd != VND_CMD_SET_DC_CONFIG &&
       cmd != VND_CMD_GET_DC_CONFIG &&
         cmd != VND_CMD_SAVE_DC_TO_FLASH &&
       cmd != VND_CMD_CALIB_DC_FAST &&
       cmd != VND_CMD_SET_STREAM_MODE){
        return;
    }

    char payload_hex[80];
    uint32_t max_dump = len > 1u ? (len - 1u) : 0u;
    if(max_dump > 12u) max_dump = 12u;

    size_t pos = 0u;
    payload_hex[0] = '\0';
    for(uint32_t i = 0u; i < max_dump; i++){
        int n = snprintf(&payload_hex[pos], sizeof(payload_hex) - pos,
                         "%02X%s",
                         (unsigned)data[1u + i],
                         (i + 1u < max_dump) ? " " : "");
        if(n <= 0) break;
        pos += (size_t)n;
        if(pos >= sizeof(payload_hex)) break;
    }

    if(max_dump == 0u){
        snprintf(payload_hex, sizeof(payload_hex), "-");
    }

    printf("[DC_CMD_RX] cmd=0x%02X len=%lu payload=%s%s\r\n",
           (unsigned)cmd,
           (unsigned long)len,
           payload_hex,
           (len > (1u + max_dump)) ? " ..." : "");

    cdc_logf("DC_CMD_RX cmd=0x%02X len=%lu payload=%s%s",
             (unsigned)cmd,
             (unsigned long)len,
             payload_hex,
             (len > (1u + max_dump)) ? " ..." : "");
}

/* --- CDC дублирование: отправляем компактную ASCII строку с первыми 64 сэмплами --- */
static __attribute__((unused)) uint32_t cdc_last_send_ms = 0;       /* для троттлинга */
static __attribute__((unused)) char     cdc_line_buf[1024];         /* статический буфер для передачи */
static __attribute__((unused)) uint16_t rd_le16(const uint8_t *p){ return (uint16_t)(p[0] | (p[1] << 8)); }
static __attribute__((unused)) uint32_t rd_le32(const uint8_t *p){ return (uint32_t)(p[0] | (p[1] << 8) | (p[2] << 16) | (p[3] << 24)); }
static void vnd_cdc_duplicate_preview(const uint8_t *buf, uint16_t len, const char *tag)
{
    /* При отключённом превью не выводим копию потока в CDC */
#if !VND_CDC_PREVIEW_ENABLE
    (void)buf; (void)len; (void)tag;
    return;
#else
    /* Троттлинг, чтобы не забивать CDC: не чаще 10 Гц */
    uint32_t now = HAL_GetTick();
    /* Периодический INIT_DBG до первой реальной кадра: каждые ~20мс выводим состояние счётчиков каналов и режимов. */
    if(streaming && vnd_stage_first_frame_ms == 0){
        static uint32_t last_init_dbg_ms = 0;
        if(now - last_init_dbg_ms >= 20){
            last_init_dbg_ms = now;
            extern volatile uint32_t adc_ch_wr_seq[2];
            extern volatile uint32_t adc_ch_rd_seq[2];
            cdc_logf("INIT_DBG t=%lu pend_init=%u wrA=%lu wrB=%lu rdA=%lu rdB=%lu ch_mode=%u async=%u ep_busy=%u",
                     (unsigned long)now,
                     (unsigned)vnd_pending_init,
                     (unsigned long)adc_ch_wr_seq[0], (unsigned long)adc_ch_wr_seq[1],
                     (unsigned long)adc_ch_rd_seq[0], (unsigned long)adc_ch_rd_seq[1],
                     (unsigned)vnd_ch_mode, (unsigned)async_mode, (unsigned)vnd_ep_busy);
        }
        /* Fallback отключён: всегда держим два канала, даже если B задерживается. */
    }
    if ((now - cdc_last_send_ms) < 100) return;
    if (!buf || len < VND_FRAME_HDR_SIZE) return;
    /* Парсим вручную поля заголовка (LE) */
    uint16_t magic = rd_le16(buf + 0);
    if (magic != 0xA55A) return;
    uint32_t seq = rd_le32(buf + 4);
    uint16_t ns  = rd_le16(buf + 12);
    if (ns == 0) return;
    if ((uint32_t)VND_FRAME_HDR_SIZE + (uint32_t)ns*2u > (uint32_t)len) return;
    unsigned off = 0;
    const char *chan = tag ? tag : "?";
    off += (unsigned)snprintf(cdc_line_buf + off, sizeof(cdc_line_buf) - off,
                              "[%s] seq=%lu n=%u first64:", chan, (unsigned long)seq, (unsigned)ns);
    uint16_t show = (ns > 64u) ? 64u : ns;
    for (uint16_t i = 0; i < show && off + 8 < sizeof(cdc_line_buf); i++)
    {
        uint16_t v = rd_le16(buf + VND_FRAME_HDR_SIZE + 2u*i);
        off += (unsigned)snprintf(cdc_line_buf + off, sizeof(cdc_line_buf) - off, " %u", (unsigned)v);
    }
    if (off + 2 < sizeof(cdc_line_buf)) {
        cdc_line_buf[off++] = '\r';
        cdc_line_buf[off++] = '\n';
    }
    uint8_t rc = CDC_Transmit_HS((uint8_t*)cdc_line_buf, (uint16_t)off);
    if (rc == USBD_OK) {
        cdc_last_send_ms = now;
    }
#endif
}

/* --- CDC события/статистика (COM-порт): START/STOP и периодическая скорость --- */
static uint32_t cdc_stats_last_ms = 0;         /* последняя отметка отправки статистики */
static uint64_t cdc_stats_prev_bytes = 0ULL;   /* предыдущее значение счётчика байт */
static char     cdc_evt_buf[160];              /* буфер форматирования событий */

