kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
static void cdc_logf(const char *fmt, ...)
{
    va_list ap;
    va_start(ap, fmt);
    int n = vsnprintf(cdc_evt_buf, sizeof(cdc_evt_buf) - 2, fmt, ap);
    va_end(ap);
    if(n < 0) return;
    if(n > (int)sizeof(cdc_evt_buf) - 2) n = (int)sizeof(cdc_evt_buf) - 2;
    cdc_evt_buf[n++] = '\r';
    cdc_evt_buf[n++] = '\n';
    /* неблокирующая попытка: если CDC занят — событие может быть пропущено */
    (void)CDC_Transmit_HS((uint8_t*)cdc_evt_buf, (uint16_t)n);
}

/* Периодическая диагностика синхронизации (slave): индекс сэмпла TIM16 на конце буфера */
static void vnd_cdc_sync_diag(uint32_t now_ms)
{
    static uint32_t last_ms = 0;
    static uint16_t prev_idx = 0;
    static uint8_t prev_valid = 0;
    if(diag_mode_active){ return; }
    if(now_ms - last_ms < 1000u){ return; } /* не чаще 1 Гц */
    last_ms = now_ms;

    if(vnd_sync_mode_public != VND_SYNC_MODE_SLAVE){
        return;
    }

    if(!adc_sync_dbg_updated){
        return;
    }
    adc_sync_dbg_updated = 0u;

    uint16_t idx = adc_sync_dbg_last_idx;
    uint16_t n = adc_sync_dbg_last_samples;
    uint32_t buf = adc_sync_dbg_last_buf;
    uint32_t age = now_ms - adc_sync_dbg_last_ms;

    uint16_t delta = 0;
    if(prev_valid && n > 0u){
        uint16_t d = (idx >= prev_idx) ? (uint16_t)(idx - prev_idx) : (uint16_t)(prev_idx - idx);
        if(d > (n / 2u)) d = (uint16_t)(n - d);
        delta = d;
    }
    prev_idx = idx;
    prev_valid = 1u;

    cdc_logf("SYNC_DBG t=%lums buf=%lu idx=%u/%u d=%u age=%lums",
             (unsigned long)now_ms,
             (unsigned long)buf,
             (unsigned)idx,
             (unsigned)n,
             (unsigned)delta,
             (unsigned long)age);
#if VND_SYNC_DIAG_PRINTF
    printf("[SYNC_DBG] t=%lums buf=%lu idx=%u/%u d=%u age=%lums\r\n",
           (unsigned long)now_ms,
           (unsigned long)buf,
           (unsigned)idx,
           (unsigned)n,
           (unsigned)delta,
           (unsigned long)age);
#endif
}

static void vnd_cdc_periodic_stats(uint32_t now_ms)
{
    /* В диагностическом режиме не трогаем CDC вовсе — уменьшаем накладные расходы */
    if(diag_mode_active){ return; }
    vnd_cdc_sync_diag(now_ms);
    if(now_ms - cdc_stats_last_ms < 1000) return; /* не чаще 1 Гц */
    cdc_stats_last_ms = now_ms;
    uint64_t cur = vnd_total_tx_bytes;
    uint64_t d   = (cur >= cdc_stats_prev_bytes) ? (cur - cdc_stats_prev_bytes) : 0ULL;
    cdc_stats_prev_bytes = cur;
    uint32_t bps = (uint32_t)d; /* за ~1 секунду */
    /* Добавляем количество переданных кадров A/B для сравнения с host RX */
    /* Новая расширенная строка: выводим попытки/отказы TX и частичные abort'ы для анализа стабильности */
    extern volatile uint32_t dbg_tx_attempt; /* объявлены выше */
    extern volatile uint32_t dbg_tx_reject;
    extern volatile uint32_t dbg_partial_frame_abort;
    extern volatile uint32_t dbg_size_mismatch;
    uint32_t tx_attempt = dbg_tx_attempt;
    uint32_t tx_reject  = dbg_tx_reject;
    uint32_t tx_ok      = dbg_tx_cplt; /* число завершённых передач (может включать STAT/TEST) */
    uint32_t frame_abort = dbg_partial_frame_abort;
    uint32_t size_mism   = dbg_size_mismatch;
    uint16_t diag_samples_cur = cur_samples_per_frame;
    uint16_t buf_rate = adc_stream_get_buf_rate();
    uint8_t channel_count = (vnd_ch_mode == 2u) ? 2u : 1u;
    uint16_t frame_bytes = 0u;
    uint32_t demand_bps = 0u;
    /* Оценка потока в Мбит/с (грубая: только пользовательские байты за 1с *8/1e6) */
    float mbps = (float)(bps * 8ULL) / 1000000.0f;

    if (diag_samples_cur == 0u) {
        if ((vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI) || (vnd_stream_mode == VND_STREAM_MODE_AVG_ROI)) {
            diag_samples_cur = (win_len0 != 0u) ? win_len0 : (uint16_t)VND_ROI_LEN_DEFAULT;
        } else if (vnd_frame_samples_req != 0u) {
            diag_samples_cur = vnd_frame_samples_req;
        } else {
            diag_samples_cur = adc_stream_get_active_samples();
            if (diag_samples_cur == 0u) {
                diag_samples_cur = (uint16_t)VND_FULL_DEFAULT_SAMPLES;
            }
        }
    }
    if (diag_samples_cur > VND_MAX_SAMPLES) {
        diag_samples_cur = VND_MAX_SAMPLES;
    }
    frame_bytes = (uint16_t)(VND_FRAME_HDR_SIZE + ((uint32_t)diag_samples_cur * 2u));
    demand_bps = (uint32_t)channel_count * (uint32_t)frame_bytes * (uint32_t)buf_rate;

    cdc_logf("STAT bytes_total=%llu bps=%lu (%.2f Mbps) streaming=%u diag=%u sentA=%lu sentB=%lu seq=%lu tx_attempt=%lu tx_reject=%lu tx_cplt=%lu abort=%lu sz_mm=%lu",
             (unsigned long long)cur, (unsigned long)bps, (double)mbps,
             (unsigned)streaming, (unsigned)diag_mode_active,
             (unsigned long)dbg_sent_ch0_total, (unsigned long)dbg_sent_ch1_total, (unsigned long)stream_seq,
             (unsigned long)tx_attempt, (unsigned long)tx_reject, (unsigned long)tx_ok,
             (unsigned long)frame_abort, (unsigned long)size_mism);
#if VND_SYNC_DIAG_PRINTF
    printf("[USB_RATE] tx=%luB/s raw=%luB/s tx=%.2fMbps raw=%.2fMbps ns=%u frame=%u ch=%u buf=%u A=%lu B=%lu txcplt=%lu\r\n",
           (unsigned long)bps,
           (unsigned long)demand_bps,
           (double)mbps,
           (double)((float)(demand_bps * 8ULL) / 1000000.0f),
           (unsigned)diag_samples_cur,
           (unsigned)frame_bytes,
           (unsigned)channel_count,
           (unsigned)buf_rate,
           (unsigned long)dbg_sent_ch0_total,
           (unsigned long)dbg_sent_ch1_total,
           (unsigned long)tx_ok);
#endif
}

/* CRC16-CCITT-FALSE: poly 0x1021, init 0xFFFF. */
static uint16_t vnd_crc16_ccitt_update(uint16_t crc, const uint8_t *data, uint32_t len)
{
    static const uint16_t crc4_table[16] = {
        0x0000u, 0x1021u, 0x2042u, 0x3063u,
        0x4084u, 0x50A5u, 0x60C6u, 0x70E7u,
        0x8108u, 0x9129u, 0xA14Au, 0xB16Bu,
        0xC18Cu, 0xD1ADu, 0xE1CEu, 0xF1EFu
    };

    for(uint32_t i = 0; i < len; ++i){
        uint8_t v = data[i];
        uint8_t idx = (uint8_t)(((crc >> 12) ^ (v >> 4)) & 0x0Fu);
        crc = (uint16_t)((crc << 4) ^ crc4_table[idx]);
        idx = (uint8_t)(((crc >> 12) ^ (v & 0x0Fu)) & 0x0Fu);
        crc = (uint16_t)((crc << 4) ^ crc4_table[idx]);
    }
    return crc;
}

static uint16_t vnd_crc16_ccitt(const uint8_t *data, uint32_t len)
{
    return vnd_crc16_ccitt_update(0xFFFFu, data, len);
}

