kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
/* Заголовок кадра */
/*
 * Формат под спецификацию хоста (ровно 32 байта, LE):
 *   [0..1] magic = 0xA55A -> 5A A5
 *   [2]    ver   = 0x01
 *   [3]    flags: 0x01=ADC0, 0x02=ADC1, 0x80=TEST, +0x04 если есть CRC16
 *   [4..7] seq (u32 LE) — общий для пары
 *   [8..11] timestamp (u32 LE) — одинаковый в паре
 *   [12..13] total_samples (u16 LE)
 *   [14..15] zone_count=0
 *   [16..19] zone1_offset=0
 *   [20..23] zone1_length=0
 *   [24..27] reserved=dma_seq/source generation
 *   [28..29] reserved2=buffer_index + source snapshot diagnostics
 *   [30..31] crc16: CRC16-CCITT-FALSE по header[0..29] + payload, если flags bit2=1
 */
typedef struct __attribute__((packed)) {
    uint16_t magic;           /* 0xA55A */
    uint8_t  ver;             /* 0x01 */
    uint8_t  flags;           /* см. описание выше */
    uint32_t seq;             /* номер логической последовательности (пары) */
    uint32_t timestamp;       /* HAL_GetTick */
    uint16_t total_samples;   /* кол-во сэмплов */
    uint16_t zone_count;      /* 0 */
    uint32_t zone1_offset;    /* 0 */
    uint32_t zone1_length;    /* 0 */
    uint32_t reserved;        /* 0 */
    uint16_t reserved2;       /* 0 */
    uint16_t crc16;           /* CRC16-CCITT-FALSE без самого поля crc16 */
} vnd_frame_hdr_t;
_Static_assert(sizeof(vnd_frame_hdr_t)==32, "vnd_frame_hdr_t must be 32 bytes (PACKING ERROR)");

static uint16_t vnd_pack_frame_reserved2(uint32_t dma_seq, uint16_t diag_flags)
{
    uint16_t buffer_index = (uint16_t)(adc_get_buffer_parity(dma_seq) & 0x07u);
    uint16_t source_slot = (uint16_t)((dma_seq % (uint32_t)FIFO_FRAMES) & 0x1Fu);
    uint16_t txcplt_lsb = (uint16_t)((dbg_tx_cplt & 0x0Fu) << VND_R2_TXCPLT_SHIFT);

    return (uint16_t)((buffer_index & VND_R2_BUFFER_INDEX_MASK) |
                      ((source_slot << VND_R2_SOURCE_SLOT_SHIFT) & VND_R2_SOURCE_SLOT_MASK) |
                      (diag_flags & (uint16_t)(VND_R2_SNAPSHOT_USED |
                                               VND_R2_GENERATION_MOVED |
                                               VND_R2_FIFO_GUARD |
                                               VND_R2_CONSUME_OK)) |
                      (txcplt_lsb & VND_R2_TXCPLT_MASK));
}

static uint16_t vnd_refresh_frame_reserved2_buffer_index(uint16_t reserved2, uint32_t dma_seq)
{
    uint16_t buffer_index = (uint16_t)(adc_get_buffer_parity(dma_seq) & 0x07u);
    return (uint16_t)((reserved2 & (uint16_t)~VND_R2_BUFFER_INDEX_MASK) | buffer_index);
}

static uint16_t vnd_frame_crc16(const uint8_t *frame, uint32_t payload_len)
{
    uint16_t crc = 0xFFFFu;
    crc = vnd_crc16_ccitt_update(crc, frame, VND_FRAME_HDR_SIZE - 2u);
    crc = vnd_crc16_ccitt_update(crc, frame + VND_FRAME_HDR_SIZE, payload_len);
    return crc;
}

static void vnd_frame_finalize_crc(uint8_t *frame)
{
    vnd_frame_hdr_t *h = (vnd_frame_hdr_t*)frame;
    uint32_t payload_len = (uint32_t)h->total_samples * 2u;

    h->flags |= VND_FRAME_FLAG_CRC16;
    h->crc16 = 0u;
    h->crc16 = vnd_frame_crc16(frame, payload_len);
    dbg_frame_crc_finalized++;
    dbg_frame_crc_last = h->crc16;
}

/* Состояние кадра */
typedef enum { FB_FILL=0, FB_READY=1, FB_SENDING=2 } frame_state_t;

typedef struct {
    volatile frame_state_t st;
    uint16_t samples;
    uint8_t  flags;
    uint16_t frame_size;
    uint32_t seq;
    uint32_t dma_seq;
    uint16_t crc16;
    uint32_t crc_seq;
    uint8_t  buf[VND_FRAME_MAX_SIZE];
} ChanFrame;

#define VND_PAIR_BUFFERS 8  /* Возврат к 8 для стабильности */
static ChanFrame g_frames[VND_PAIR_BUFFERS][2];
static uint8_t pair_fill_idx = 0;
static uint8_t pair_send_idx = 0;
static uint8_t sending_channel = 0xFF; /* 0 /1 когда активна передача */
/* Простой режим управления отправкой: только из таска */
static uint8_t simple_tx_mode = 1;
/* Флаги машины состояний по требованию хоста */
static volatile uint8_t pending_B = 0;  /* 1 = нужно отправить B после A */
/* Диагностика зависаний между A и B */
static uint32_t pending_B_since_ms = 0; /* время, когда завершилась передача A и мы начали ждать B */

/* Прототипы */
static void vnd_reset_buffers(void);
// static void vnd_send_test_frame(void); // удален, не используется
static void vnd_prepare_pair(void);
static void vnd_build_frame(ChanFrame *cf);
static uint8_t vnd_get_active_stream_slot(uint8_t want_b);
void USBD_VND_TxCplt(void);
static void vnd_consume_strict_fifo_pair(uint8_t slot);
static void vnd_clear_pair_slot(uint8_t slot);
static int vnd_find_pair_by_seq(uint32_t seq);
static void vnd_try_start_tx(void);
static int  vnd_validate_frame(const uint8_t *buf, uint16_t len, uint8_t expect_test, uint8_t allow_zero_samples);
static USBD_StatusTypeDef vnd_transmit_frame(uint8_t *buf, uint16_t len, uint8_t is_test, uint8_t allow_zero_samples, const char *tag);
/* Диагностика: подготовка и отправка A/B тестовой пары (упрощённой) */
static void vnd_diag_prepare_pair(uint32_t seq, uint16_t samples);
static int  vnd_diag_try_tx(void);
/* Классификация последнего отправленного буфера для корректного разбора в TxCplt */
typedef struct {
    uint8_t  is_frame;      /* 1 = кадр с заголовком */
    uint8_t  flags;         /* исходные flags из hdr (0x01/0x02/0x80) */
    uint32_t seq_field;     /* seq из hdr на момент отправки */
    uint32_t push_tick;     /* HAL_GetTick() при постановке в FIFO */
} vnd_tx_meta_t;
#define VND_TX_META_FIFO 8
static vnd_tx_meta_t vnd_tx_meta_fifo[VND_TX_META_FIFO];
static uint8_t vnd_tx_meta_head = 0; /* push */
static uint8_t vnd_tx_meta_tail = 0; /* pop */
/* Диагностические счётчики метаданных */
static uint32_t meta_push_total = 0;
static uint32_t meta_pop_total = 0;
static uint32_t meta_empty_events = 0;
static uint32_t meta_overflow_events = 0;
static inline uint8_t vnd_tx_meta_depth(void){
    uint8_t h = vnd_tx_meta_head, t = vnd_tx_meta_tail;
    if(h>=t) return (uint8_t)(h - t);
    return (uint8_t)(VND_TX_META_FIFO - (t - h));
}

static inline uint32_t vnd_delta_u32(uint32_t cur, uint32_t prev)
{
    return (cur >= prev) ? (cur - prev) : cur;
}

static void vnd_note_task_entry(uint32_t now_ms)
{
    static uint32_t prev_ms = 0u;
    static uint8_t prev_streaming = 0u;

    if(prev_ms != 0u){
        uint32_t gap_ms = (uint32_t)(now_ms - prev_ms);
        if(gap_ms > dbg_task_gap_max_ms){
            dbg_task_gap_max_ms = gap_ms;
        }
        if(gap_ms > 100u){
            dbg_task_gap_count++;
            dbg_task_gap_last_ms = gap_ms;
            if(prev_streaming && gap_ms > 500u){
                printf("[TASKGAP] t=%lu gap=%lu prev_stream=1 stream=%u task=%lu\r\n",
                       (unsigned long)now_ms,
                       (unsigned long)gap_ms,
                       (unsigned)streaming,
                       (unsigned long)dbg_task_calls);
            }
        }
    }

    prev_ms = now_ms;
    prev_streaming = streaming ? 1u : 0u;
}

static void vnd_uart_stream_stats(uint32_t now_ms)
{
    static uint32_t last_ms = 0u;
    static uint32_t prev_task = 0u;
    static uint32_t prev_hb = 0u;
    static uint32_t prev_txcplt = 0u;
    static uint32_t prev_sent_a = 0u;
    static uint32_t prev_sent_b = 0u;
    static uint32_t prev_wr = 0u;
    static uint32_t prev_rd = 0u;
    static uint32_t prev_avg_in = 0u;
    static uint32_t prev_avg_out = 0u;
    static uint32_t prev_avg_tx = 0u;
    static uint32_t prev_data_in = 0u;

