kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
static void vnd_put_le16(uint8_t *dst, uint16_t v)
{
    dst[0] = (uint8_t)(v & 0xFFu);
    dst[1] = (uint8_t)((v >> 8) & 0xFFu);
}

static void vnd_put_le32(uint8_t *dst, uint32_t v)
{
    dst[0] = (uint8_t)(v & 0xFFu);
    dst[1] = (uint8_t)((v >> 8) & 0xFFu);
    dst[2] = (uint8_t)((v >> 16) & 0xFFu);
    dst[3] = (uint8_t)((v >> 24) & 0xFFu);
}

static uint8_t vnd_event_enqueue(uint8_t event_type, const uint8_t *payload, uint16_t payload_len)
{
    if(payload_len > (uint16_t)(VND_EVENT_MAX - VND_EVENT_HDR_SIZE)){
        return 0u;
    }

    if(vnd_event_count >= VND_EVENT_QUEUE_LEN){
        vnd_event_tail = (uint8_t)((vnd_event_tail + 1u) % VND_EVENT_QUEUE_LEN);
        vnd_event_count--;
        dbg_event_dropped++;
    }

    uint8_t idx = vnd_event_head;
    uint8_t *pkt = vnd_event_q[idx];
    uint32_t seq = vnd_event_seq++;
    uint32_t now_ms = HAL_GetTick();

    pkt[0] = (uint8_t)'E';
    pkt[1] = (uint8_t)'V';
    pkt[2] = (uint8_t)'T';
    pkt[3] = (uint8_t)'1';
    pkt[4] = 1u;
    pkt[5] = event_type;
    vnd_put_le16(&pkt[6], payload_len);
    vnd_put_le32(&pkt[8], seq);
    vnd_put_le32(&pkt[12], now_ms);
    if(payload_len != 0u && payload != NULL){
        memcpy(&pkt[VND_EVENT_HDR_SIZE], payload, payload_len);
    }

    vnd_event_len[idx] = (uint8_t)(VND_EVENT_HDR_SIZE + payload_len);
    vnd_event_head = (uint8_t)((vnd_event_head + 1u) % VND_EVENT_QUEUE_LEN);
    vnd_event_count++;
    vnd_event_last_enqueue_ms = now_ms;
    dbg_event_enqueued++;
    dbg_event_last_enqueue_type = event_type;
    vnd_tx_kick = 1u;
    return 1u;
}

static uint16_t vnd_absdiff_u16(uint16_t a, uint16_t b)
{
    return (a >= b) ? (uint16_t)(a - b) : (uint16_t)(b - a);
}

static uint8_t vnd_payload_changed(const uint8_t *payload,
                                   uint8_t payload_len,
                                   uint8_t *last_payload,
                                   uint8_t *last_len,
                                   uint8_t *have_last)
{
    if((payload == NULL) || (last_payload == NULL) || (last_len == NULL) || (have_last == NULL)){
        return 0u;
    }
    if((*have_last == 0u) || (*last_len != payload_len)){
        return 1u;
    }
    return (memcmp(last_payload, payload, payload_len) != 0) ? 1u : 0u;
}

static void vnd_payload_remember(const uint8_t *payload,
                                 uint8_t payload_len,
                                 uint8_t *last_payload,
                                 uint8_t *last_len,
                                 uint8_t *have_last)
{
    if((payload == NULL) || (last_payload == NULL) || (last_len == NULL) || (have_last == NULL)){
        return;
    }
    memcpy(last_payload, payload, payload_len);
    *last_len = payload_len;
    *have_last = 1u;
}

static void vnd_copy_ascii_fixed(uint8_t *dst, uint8_t len, const char *src)
{
    uint8_t i;

    if((dst == NULL) || (len == 0u)){
        return;
    }
    memset(dst, 0, len);
    if(src == NULL){
        return;
    }
    for(i = 0u; (i < len) && (src[i] != '\0'); i++){
        dst[i] = (uint8_t)src[i];
    }
}

static void vnd_change_event_force_report(void)
{
    vnd_change_force_event = 1u;
    vnd_tx_kick = 1u;
}

static void vnd_emit_fw_info_event(uint8_t force)
{
    uint8_t payload[47];

    if(force == 0u){
        return;
    }

    payload[0] = 1u;
    payload[1] = (uint8_t)FW_VERSION_MAJOR;
    payload[2] = (uint8_t)FW_VERSION_MINOR;
    payload[3] = (uint8_t)FW_VERSION_PATCH;
    payload[4] = 0u;
    vnd_put_le32(&payload[5], HAL_GetUIDw0());
    vnd_put_le32(&payload[9], HAL_GetUIDw1());
    vnd_put_le32(&payload[13], HAL_GetUIDw2());
    vnd_copy_ascii_fixed(&payload[17], 10u, fw_build_date);
    vnd_copy_ascii_fixed(&payload[27], 8u, fw_build_time);
    vnd_copy_ascii_fixed(&payload[35], 12u, fw_git_hash);

    (void)vnd_event_enqueue(VND_EVT_TYPE_FW_INFO, payload, (uint16_t)sizeof(payload));
}

static uint8_t vnd_mcu_adc_changed(const mcu_internal_adc_v1_t *now)
{
    if(now == NULL){
        return 0u;
    }
    if(vnd_mcu_adc_have_last == 0u){
        return 1u;
    }
    if(now->flags != vnd_mcu_adc_last_sent.flags){
        return 1u;
    }
    if(now->temp_c != vnd_mcu_adc_last_sent.temp_c){
        return 1u;
    }
    if(vnd_absdiff_u16(now->vdda_mv, vnd_mcu_adc_last_sent.vdda_mv) >= (uint16_t)VND_SENSOR_VDDA_DELTA_MV){
        return 1u;
    }
    if(vnd_absdiff_u16(now->vbat_mv, vnd_mcu_adc_last_sent.vbat_mv) >= (uint16_t)VND_SENSOR_VBAT_DELTA_MV){
        return 1u;
    }
    return 0u;
}

static void vnd_emit_mcu_adc_events(const mcu_internal_adc_v1_t *snap, uint8_t force)
{
    if(snap == NULL){
        return;
    }

    vnd_temp_last_read_c = snap->temp_c;
    if((force != 0u) || (snap->temp_c != vnd_temp_last_sent_c)){
        uint8_t temp_payload[2];
        vnd_put_le16(temp_payload, (uint16_t)snap->temp_c);
        if(vnd_event_enqueue(VND_EVT_TYPE_TEMP_C, temp_payload, (uint16_t)sizeof(temp_payload))){
            vnd_temp_last_sent_c = snap->temp_c;
        }
    }

    if((force != 0u) || vnd_mcu_adc_changed(snap)){
        uint8_t payload[16];
        payload[0] = snap->version;
        payload[1] = snap->flags;
        vnd_put_le16(&payload[2], (uint16_t)snap->temp_c);
        vnd_put_le16(&payload[4], snap->vdda_mv);
        vnd_put_le16(&payload[6], snap->vbat_mv);
        vnd_put_le16(&payload[8], snap->raw_temp);
        vnd_put_le16(&payload[10], snap->raw_vrefint);
        vnd_put_le16(&payload[12], snap->raw_vbat);
        vnd_put_le16(&payload[14], snap->reserved);
        if(vnd_event_enqueue(VND_EVT_TYPE_MCU_ADC, payload, (uint16_t)sizeof(payload))){
            vnd_mcu_adc_last_sent = *snap;
            vnd_mcu_adc_have_last = 1u;
        }
    }
}

static void vnd_sensor_event_poll(uint32_t now_ms, uint8_t force)
{
    uint8_t due = force;
    mcu_internal_adc_v1_t snap;

    if((uint32_t)(now_ms - vnd_sensor_last_poll_ms) >= (uint32_t)VND_TEMP_EVENT_PERIOD_MS){
        due = 1u;
    }
    if(due == 0u){
        return;
    }

