kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    vnd_sensor_last_poll_ms = now_ms;
    if(mcu_internal_adc_read(&snap)){
        vnd_emit_mcu_adc_events(&snap, force);
    }
}

static void vnd_emit_optic_state_event(uint8_t force)
{
    uint8_t payload[8];
    uint8_t flags = 0u;

    if(optic_sensor_get_state() != 0u){
        flags |= 0x01u;
    }
    if(vnd_tx_enable != 0u){
        flags |= 0x02u;
    }

    payload[0] = 1u;
    payload[1] = flags;
    payload[2] = optic_tx_get_power();
    payload[3] = dynamic_led_get_pattern();
    vnd_put_le16(&payload[4], optic_sensor_get_hold_deciseconds());
    payload[6] = 0u;
    payload[7] = 0u;

    if((force != 0u) ||
       vnd_payload_changed(payload, (uint8_t)sizeof(payload),
                           vnd_optic_last_payload, &vnd_optic_last_len, &vnd_optic_have_last)){
        if(vnd_event_enqueue(VND_EVT_TYPE_OPTIC_STATE, payload, (uint16_t)sizeof(payload))){
            vnd_payload_remember(payload, (uint8_t)sizeof(payload),
                                 vnd_optic_last_payload, &vnd_optic_last_len, &vnd_optic_have_last);
        }
    }
}

static void vnd_emit_sync_state_event(uint8_t force)
{
    vnd_lcd_sync_snapshot_t lcd;
    uint8_t local_status = 0u;
    uint8_t active_status_count = 0u;
    uint32_t seen_mask = 0u;
    uint8_t payload[16];
    uint8_t flags = 0u;
    uint8_t total_devices = 1u;
    uint32_t age_ds = 0xFFFFu;

    memset(&lcd, 0, sizeof(lcd));
    vnd_get_lcd_sync_snapshot(&lcd);
    (void)rs485_status_get_snapshot(&local_status, &active_status_count, &seen_mask, NULL, 31u);

    if(lcd.raw_mode == VND_SYNC_MODE_MASTER){
        total_devices = (uint8_t)(active_status_count + 1u);
    } else if(lcd.raw_mode == VND_SYNC_MODE_SLAVE){
        total_devices = (active_status_count != 0u) ? active_status_count : 1u;
    }
    if(total_devices == 0u){
        total_devices = 1u;
    }

    if(lcd.sync_signal_alive != 0u) flags |= 0x01u;
    if(lcd.sync_ok_visual != 0u) flags |= 0x02u;
    if(lcd.sync_color_locked != 0u) flags |= 0x04u;
    if(vnd_sync_is_mode_host_forced() != 0u) flags |= 0x08u;
    if(vnd_sync_ok_public != 0u) flags |= 0x10u;
    if(lcd.sync_age_ms != 0xFFFFFFFFu){
        age_ds = lcd.sync_age_ms / 100u;
        if(age_ds > 0xFFFFu) age_ds = 0xFFFFu;
    }

    payload[0] = 1u;
    payload[1] = lcd.raw_mode;
    payload[2] = lcd.display_mode;
    payload[3] = lcd.display_char;
    payload[4] = lcd.node_id;
    payload[5] = active_status_count;
    payload[6] = total_devices;
    payload[7] = flags;
    vnd_put_le32(&payload[8], seen_mask);
    payload[12] = lcd.display_value;
    payload[13] = (uint8_t)(local_status & 0xE0u);
    vnd_put_le16(&payload[14], (uint16_t)age_ds);

    if((force != 0u) ||
       vnd_payload_changed(payload, 14u,
                           vnd_sync_last_payload, &vnd_sync_last_len, &vnd_sync_have_last)){
        if(vnd_event_enqueue(VND_EVT_TYPE_SYNC_STATE, payload, (uint16_t)sizeof(payload))){
            vnd_payload_remember(payload, 14u,
                                 vnd_sync_last_payload, &vnd_sync_last_len, &vnd_sync_have_last);
        }
    }
}

static uint8_t vnd_host_rx_alive_now(uint32_t now_ms)
{
    uint32_t age_ms = 0u;
    return (uint8_t)(streaming &&
                     vnd_tick_age_ms(now_ms, vnd_last_host_rx_ack_ms, &age_ms) &&
                     age_ms <= VND_HOST_RX_ACK_TIMEOUT_MS);
}

static void vnd_emit_mode_state_event(uint32_t now_ms, uint8_t force)
{
    uint8_t payload[16];
    uint8_t flags = 0u;

    if(streaming) flags |= 0x01u;
    if(diag_mode_active) flags |= 0x02u;
    if(vnd_pending_init) flags |= 0x04u;
    if(vnd_stream_active) flags |= 0x08u;
    if(full_mode) flags |= 0x10u;
    if(async_mode) flags |= 0x20u;
    if(vnd_tx_enable) flags |= 0x40u;
    if(vnd_host_rx_alive_now(now_ms)) flags |= 0x80u;

    payload[0] = 1u;
    payload[1] = flags;
    payload[2] = vnd_stream_mode;
    payload[3] = vnd_ch_mode;
    payload[4] = host_profile;
    payload[5] = vnd_avg_n;
    vnd_put_le16(&payload[6], cur_samples_per_frame);
    vnd_put_le16(&payload[8], vnd_frame_samples_req);
    vnd_put_le16(&payload[10], vnd_trunc_samples);
    payload[12] = vnd_sync_mode_public;
    payload[13] = vnd_sync_is_mode_host_forced();
    payload[14] = 0u;
    payload[15] = 0u;

    if((force != 0u) ||
       vnd_payload_changed(payload, (uint8_t)sizeof(payload),
                           vnd_mode_last_payload, &vnd_mode_last_len, &vnd_mode_have_last)){
        if(vnd_event_enqueue(VND_EVT_TYPE_MODE_STATE, payload, (uint16_t)sizeof(payload))){
            vnd_payload_remember(payload, (uint8_t)sizeof(payload),
                                 vnd_mode_last_payload, &vnd_mode_last_len, &vnd_mode_have_last);
        }
    }
}

static void vnd_emit_error_state_event(uint8_t force)
{
    uint8_t payload[16];
    uint8_t flags = 0u;
    uint32_t last_error = vnd_last_error;

    if(last_error != 0u){
        flags |= 0x01u;
    }
    if(vnd_ep_busy || vnd_inflight){
        flags |= 0x02u;
    }

    payload[0] = 1u;
    payload[1] = flags;
    vnd_put_le16(&payload[2], (last_error > 0xFFFFu) ? 0xFFFFu : (uint16_t)last_error);
    vnd_put_le32(&payload[4], vnd_error_counter);
    vnd_put_le32(&payload[8], dbg_tx_force_idle_count);
    vnd_put_le32(&payload[12], dbg_tx_drop_recovery_count);

    if((force != 0u) ||
       vnd_payload_changed(payload, (uint8_t)sizeof(payload),
                           vnd_error_last_payload, &vnd_error_last_len, &vnd_error_have_last)){
        if(vnd_event_enqueue(VND_EVT_TYPE_ERROR_STATE, payload, (uint16_t)sizeof(payload))){
            vnd_payload_remember(payload, (uint8_t)sizeof(payload),
                                 vnd_error_last_payload, &vnd_error_last_len, &vnd_error_have_last);
        }
    }
}

static void vnd_state_event_poll(uint32_t now_ms, uint8_t force)
{
    uint8_t due = force;
    uint8_t heartbeat = 0u;

    if((uint32_t)(now_ms - vnd_state_last_poll_ms) >= (uint32_t)VND_STATE_EVENT_PERIOD_MS){
        due = 1u;
    }
    if((vnd_event_count == 0u) &&
       ((uint32_t)(now_ms - vnd_event_last_enqueue_ms) >= (uint32_t)VND_EVENT_HEARTBEAT_MS)){
        due = 1u;
        heartbeat = 1u;
    }
    if(due == 0u){
        return;
    }
    vnd_state_last_poll_ms = now_ms;

    vnd_emit_fw_info_event(force);
    vnd_emit_optic_state_event(force);
    vnd_emit_sync_state_event(force);
    vnd_emit_mode_state_event(now_ms, (uint8_t)(force || heartbeat));
    vnd_emit_error_state_event(force);
}

void Vendor_ChangeEvent_Task(void)
{
    uint32_t now_ms = HAL_GetTick();
    uint8_t force;

