kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    force = vnd_change_force_event;
    vnd_state_event_poll(now_ms, force);
    vnd_sensor_event_poll(now_ms, force);
    if(force != 0u){
        vnd_change_force_event = 0u;
    }
}

static uint8_t vnd_has_pending_event(void)
{
    return (uint8_t)(vnd_event_count != 0u);
}

static uint8_t vnd_can_preempt_stream_with_event(void)
{
    if(!vnd_has_pending_event()) return 0u;
    if(!streaming) return 1u;
    if(!first_pair_done && !vnd_stream_active) return 0u;
    if(pending_B || sending_channel != 0xFFu) return 0u;
    return 1u;
}

static void vnd_try_send_pending_event_from_task(void)
{
    if(!vnd_has_pending_event()) return;
    if(vnd_ep_busy || vnd_inflight){
        dbg_event_tx_defer++;
        return;
    }
    uint32_t now_ms = HAL_GetTick();
    if((vnd_event_next_tx_ms != 0u) && ((int32_t)(now_ms - vnd_event_next_tx_ms) < 0)){
        dbg_event_tx_defer++;
        return;
    }

    uint8_t idx = vnd_event_tail;
    uint16_t l = vnd_event_len[idx];
    if(l < VND_EVENT_HDR_SIZE || l > VND_EVENT_MAX){
        vnd_event_tail = (uint8_t)((vnd_event_tail + 1u) % VND_EVENT_QUEUE_LEN);
        if(vnd_event_count != 0u) vnd_event_count--;
        return;
    }
    uint8_t event_type = vnd_event_q[idx][5];

    vnd_status_permit_once = 1;
    vnd_tx_ready = 0;
    vnd_ep_busy = 1;
    vnd_last_tx_len = l;
    vnd_last_tx_start_ms = now_ms;
    vnd_mark_service_inflight();
    dbg_event_tx_attempt++;
    vnd_event_inflight_type = event_type;
    vnd_event_inflight_len = (uint8_t)l;
    if(USBD_VND_Transmit(&hUsbDeviceHS, vnd_event_q[idx], l) == USBD_OK){
        vnd_tx_meta_after(vnd_event_q[idx], l);
        vnd_event_tail = (uint8_t)((vnd_event_tail + 1u) % VND_EVENT_QUEUE_LEN);
        if(vnd_event_count != 0u) vnd_event_count--;
        dbg_event_tx_ok++;
        dbg_event_last_tx_type = event_type;
        vnd_event_next_tx_ms = 0u;
    } else {
        dbg_event_tx_fail++;
        vnd_event_next_tx_ms = now_ms + 20u;
        vnd_event_inflight_type = 0xFFu;
        vnd_event_inflight_len = 0u;
        vnd_status_permit_once = 0;
        vnd_rollback_tx_start();
    }
}

/* Отправка отложенного STAT только из таска */
static void vnd_try_send_pending_status_from_task(void)
{
    /* В диагностическом режиме полностью запрещаем любые STAT по bulk-IN,
       чтобы исключить окна между A и B. Для статуса используйте EP0 (ctrl).
       Также ACK-STOP в DIAG не отправляем через bulk (см. обработчик STOP). */
    if(diag_mode_active){ return; }
    if(!pending_status) return;
    /* Нельзя отправлять STAT, если есть незавершённая передача (даже если busy временно сброшен) */
    if(vnd_ep_busy || vnd_inflight) return;
    uint16_t l = vnd_build_status((uint8_t*)status_buf, sizeof(status_buf));
    if(!l) { pending_status = 0; return; } /* (очистка дублирующего кода STAT уже выполнена выше) */
    vnd_status_permit_once = 1;
    vnd_tx_ready = 0; vnd_ep_busy = 1; vnd_last_tx_len = l; vnd_last_tx_start_ms = HAL_GetTick();
    vnd_mark_service_inflight();
    if(USBD_VND_Transmit(&hUsbDeviceHS, (uint8_t*)status_buf, l) == USBD_OK){
        vnd_tx_meta_after((uint8_t*)status_buf, l);
        VND_LOG("STAT_TX pending(task) len=%u depth=%u", l, (unsigned)vnd_tx_meta_depth());
        if(stop_request){ stop_stat_inflight = 1; }
        pending_status = 0;
    } else {
        VND_LOG("STAT_TX pending(task) busy/fail");
        vnd_status_permit_once = 0;
        vnd_rollback_tx_start();
    }
}

void Vendor_Status_Task(void)
{
    if(!streaming && !vnd_ep_busy && !vnd_inflight){
        vnd_try_send_pending_status_from_task();
    }
}

void Vendor_Maintenance_Task(void)
{
#ifndef VND_MAINT_ENABLE_DC_LOAD
#define VND_MAINT_ENABLE_DC_LOAD 1u
#endif
#ifndef VND_MAINT_ENABLE_DC_BACKGROUND
#define VND_MAINT_ENABLE_DC_BACKGROUND 1u
#endif
#ifndef VND_MAINT_ENABLE_DC_SAVE
#define VND_MAINT_ENABLE_DC_SAVE 1u
#endif
#if VND_MAINT_ENABLE_DC_LOAD
    vnd_dc_load_once();

    if(vnd_dc_load_request){
        vnd_dc_load_request = 0;
        vnd_dc_load_once();
    }
#endif
#if VND_MAINT_ENABLE_DC_BACKGROUND
    {
        uint16_t roi_start = win_start0;
        uint16_t roi_len   = win_len0;
        if(roi_len == 0u){
            if(win_auto){
                vnd_apply_auto_roi_window();
                roi_start = win_start0;
                roi_len = win_len0;
            } else {
                roi_start = (uint16_t)VND_ROI_BASE_START_200HZ;
                roi_len = (uint16_t)VND_ROI_LEN_DEFAULT;
            }
        }
        vnd_dc_background_step(roi_start, roi_len);
#if VND_MAINT_ENABLE_DC_SAVE
        vnd_dc_try_save_periodic();
#endif
    }
#endif

    {
        uint32_t now_ms = HAL_GetTick();
        if(vnd_sync_mode == VND_SYNC_MODE_MASTER){
            uint16_t hz = adc_stream_get_buf_rate();
            if(hz != 0u && hz != vnd_sync_last_hz){
                vnd_sync_set_master(hz);
            }
            vnd_sync_ok_public = 1u;
        } else if(vnd_sync_mode == VND_SYNC_MODE_SLAVE){
            uint16_t hz = vnd_sync_pending_hz;
            if(hz != 0u && (now_ms - vnd_sync_last_apply_ms) > 200u){
                vnd_sync_pending_hz = 0;
                vnd_sync_last_apply_ms = now_ms;
                if(win_auto && (vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI)){
                    uint16_t prev_start = win_start0;
                    vnd_apply_auto_roi_window();
                    if(win_start0 != prev_start){
                        vnd_avg_reset();
                        vnd_update_lcd_params();
                    }
                }
            }
            {
                extern volatile uint32_t sync_last_edge_ms;
                vnd_sync_ok_public = (uint8_t)((sync_last_edge_ms != 0u && (now_ms - sync_last_edge_ms) <= 1000u) ? 1u : 0u);
            }
        }
    }

    if (vnd_adc_restart_request) {
        vnd_adc_restart_request = 0;
        HAL_StatusTypeDef rrc = adc_stream_restart(NULL, NULL);
        {
            adc_stream_debug_t dbg;
            adc_stream_get_debug(&dbg);
            dma_snapshot_full0 = dbg.dma_full0;
            dma_snapshot_full1 = dbg.dma_full1;
        }
        cdc_logf("EVT ADC_RESTART on MODE rc=%d", (int)rrc);
        vnd_tx_kick = 1;
    }
}

