kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    /* Убран подробный лог PREPARE_PAIR — счётчики агрегируются в периодическую статистику */
    uint16_t *ch1 = NULL, *ch2 = NULL; uint16_t samples = 0;
    (void)ch1; (void)ch2; /* могут быть неиспользованы в режиме overlay */
    uint16_t crc_a = 0; uint32_t crc_seq = 0;
    uint32_t pair_seq = 0;
    uint8_t used_avg_q = 0;
    uint8_t used_avg_q_idx = 0;
    uint32_t used_avg_ts_ms = 0;
    /* Локальный снапшот staging-буфера, чтобы TC не перезаписал usb_stage_bufA во время копирования */
    static __attribute__((unused)) uint16_t stage_copy[MAX_FRAME_SAMPLES];
    uint16_t stage_samples = 0;
    (void)stage_samples; /* может быть неиспользован при ADC_USB_STAGE_ENABLE=0 */
    
#if USE_TEST_SAWTOOTH
    /* Тестовый режим: используем последнюю сгенерированную пару буферов */
    {
        /* Генерируем свежий буфер-пилу (1..N) перед выборкой */
        vnd_generate_test_sawtooth();
        uint16_t *tb0 = NULL, *tb1 = NULL; uint16_t avail = 0;
        if(!vnd_testgen_try_consume_latest(&tb0, &tb1, &avail)){
            return; /* нет новых данных */
        }
        ch1 = tb0; ch2 = tb1;
        samples = (avail != 0) ? avail : 302;  /* МАРКЕР #2 - fallback если avail=0 */
        (void)ch1; (void)ch2; /* используем в тестовом режиме, чтобы подавить предупреждения */
        (void)stage_samples; (void)seq; (void)static_mode; (void)static_seq;
        static uint32_t test_seq = 0; pair_seq = ++test_seq;
        /* Зафиксировать размер кадра, если ещё не задан, чтобы отправка не зависела от профиля АЦП */
        if(cur_samples_per_frame == 0){
            uint16_t eff = samples;
            if(eff > VND_MAX_SAMPLES) eff = VND_MAX_SAMPLES;
            cur_samples_per_frame = eff;
            cur_expected_frame_size = (uint16_t)(VND_FRAME_HDR_SIZE + (uint32_t)eff * 2u);
        }
    }
#else
        /* Два режима:
             0) LATEST (как сейчас): "последний заполненный буфер", пропуски допустимы.
                 1) LOSSLESS_ROI: строго по FIFO (без пропусков на стороне прошивки), но отправляем только окно ROI.
                         Окно задаётся win_start0/win_len0; по умолчанию 280..480 (200) и сдвигается по частоте. */
    if (vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI)
    {
        /* ROI окно */
        uint16_t roi_start = win_start0;
        uint16_t roi_len   = win_len0;
        if(roi_len == 0u){
            roi_len = VND_ROI_LEN_DEFAULT;
            if(win_auto){
                vnd_apply_auto_roi_window();
                roi_start = win_start0;
            } else {
                roi_start = 0u;
            }
        }
        if(roi_len > VND_MAX_SAMPLES) roi_len = VND_MAX_SAMPLES;
        if(roi_len > MAX_FRAME_SAMPLES) roi_len = MAX_FRAME_SAMPLES;

        if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI)
        {
            /* Берём следующий кадр строго по очереди (A+B синхронно по DMA seq) */
            if(!adc_peek_frame_pair_fifo(&ch1, &ch2, &samples, &pair_seq)){
                return;
            }
            if(samples < (uint16_t)(roi_start + roi_len)){
                /* Профиль/размер кадра не подходит под ROI — ждём корректного кадра */
                (void)adc_consume_frame_pair_fifo(pair_seq);
                return;
            }
            /* Лочим формат кадра на ROI длину */
            if(cur_samples_per_frame != roi_len){
                cur_samples_per_frame = roi_len;
                cur_expected_frame_size = (uint16_t)(VND_FRAME_HDR_SIZE + (uint32_t)cur_samples_per_frame * 2u);
            }
            /* Смещаем указатели на начало ROI (FIFO-блоки стабильно хранят данные по seq). */
            ch1 = ch1 + roi_start;
            ch2 = ch2 + roi_start;
            /* В ROI режиме не используем precomputed CRC из staging (оно было для полного кадра). */
            crc_a = 0; crc_seq = 0;
            samples = cur_samples_per_frame;
        }
        else
        {
            /* stream_mode=2: выдаём только готовые усреднённые ROI кадры из очереди.
               Сбор/усреднение идёт в фоне через vnd_avg_drain_fifo(), чтобы не терять входные кадры. */
            if(vnd_avg_q_count == 0){
                return;
            }
            used_avg_q = 1;
            used_avg_q_idx = vnd_avg_q_head;

            /* Инициализируем формат кадра по ROI длине */
            if(cur_samples_per_frame != roi_len){
                cur_samples_per_frame = roi_len;
                cur_expected_frame_size = (uint16_t)(VND_FRAME_HDR_SIZE + (uint32_t)cur_samples_per_frame * 2u);
            }

            /* seq в заголовке делаем непрерывным (по stream_seq), а dma_seq кладём в reserved */
            pair_seq = stream_seq;
            used_avg_ts_ms = vnd_avg_q_ts_ms[used_avg_q_idx];
            crc_seq = vnd_avg_q_dma_seq[used_avg_q_idx]; /* временно переносим out_dma_seq */

            /* Указатели на усреднённые данные */
            ch1 = vnd_avg_q_out[used_avg_q_idx][0];
            ch2 = vnd_avg_q_out[used_avg_q_idx][1];
            samples = roi_len;
            crc_a = 0;
        }
    }
    else
    {
        /* ПОЛИТИКА last-buffer-wins: выбираем САМЫЙ ПОСЛЕДНИЙ полный кадр и пропускаем старые.
            Это повышает визуальную частоту при ограниченной пропускной способности USB. */
        // Читаем s_next_ring_index и отслеживаем изменения
        extern volatile uint32_t s_next_ring_index;
        static uint32_t last_current = 0xFFFFFFFF;
        static uint32_t local_seq = 0;
        
        __disable_irq();
        uint32_t current = s_next_ring_index;
        __enable_irq();
        
        // Отправляем данные ТОЛЬКО когда s_next_ring_index изменился
        if (current != last_current) {
            last_current = current;
            local_seq++;  // Инкрементируем счётчик кадров
        } else {
            return;  // Нет новых данных - пропускаем
        }
        
        // Вычисляем индекс последнего заполненного буфера
        uint32_t idx = (current + FIFO_FRAMES - 1) & (FIFO_FRAMES - 1);
        
        if (idx >= FIFO_FRAMES) return;
        
