kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
            /* reserved2: low bits stay buffer_index; high bits carry source snapshot diagnostics. */
            h->reserved2 = vnd_pack_frame_reserved2(dma_seq, frame_r2_diag);
            dbg_async_last_reserved2[ch] = h->reserved2;
            
            h->crc16 = 0u;
            h->flags &= (uint8_t)~VND_FRAME_FLAG_CRC16;
            tf[ch].samples = eff; tf[ch].seq = stream_seq; tf[ch].dma_seq = dma_seq; tf[ch].frame_len = (uint16_t)(VND_FRAME_HDR_SIZE + eff*2u); tf[ch].ch = (uint8_t)ch; tf[ch].valid = 1;
        }
    }
    if(roi_pair_valid && tf[0].valid && tf[1].valid){
        uint8_t pair_consume_ok = adc_consume_frame_pair_fifo(roi_pair_dma_seq);
        if(pair_consume_ok != 0u){
            for(uint8_t c = 0u; c < 2u; c++){
                vnd_frame_hdr_t *hh = (vnd_frame_hdr_t*)tf[c].buf;
                hh->reserved2 |= VND_R2_CONSUME_OK;
                dbg_async_consume_ok[c]++;
                dbg_async_last_reserved2[c] = hh->reserved2;
            }
        } else {
            dbg_async_consume_fail[0]++;
            dbg_async_consume_fail[1]++;
        }
    }

    /* Выбор канала:
       1) Если валиден только один — берём его.
       2) Если оба — чередуем относительно last_sent_ch.
       3) Если ни одного — return 0. */
    int haveA = tf[0].valid ? 1:0;
    int haveB = tf[1].valid ? 1:0;
    int pick = -1;
    if(vnd_ch_mode == 2 && vnd_strict_pairing){
        /* Строгая парность: если оба готовы — чередуем, если готов только один и уже отправляли его для текущего seq — ждём второй */
        if(haveA && haveB){ pick = (last_sent_ch==0)?1:0; }
        else if(haveA && !haveB){ if(seq_mask == 0x01) return 0; pick = 0; }
        else if(haveB && !haveA){ if(seq_mask == 0x02) return 0; pick = 1; }
        else return 0;
    } else {
        /* Независимые каналы (дефолт): отправляем что есть, при наличии обоих — чередуем */
        if(haveA && !haveB) pick = 0;
        else if(haveB && !haveA) pick = 1;
        else if(haveA && haveB){ pick = (last_sent_ch==0)?1:0; }
        else return 0;
    }

    tmp_frame_t *sel = &tf[pick];
    if(!sel->valid) return 0;
    
    /* Гарантируем согласованность метаданных заголовка с DMA-кадром */
    vnd_frame_hdr_t *h = (vnd_frame_hdr_t*)sel->buf;
    h->seq = (vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI) ? sel->seq : h->reserved;
    h->reserved2 = vnd_refresh_frame_reserved2_buffer_index(h->reserved2, h->reserved);
    vnd_frame_finalize_crc(sel->buf);
    dbg_async_last_reserved2[pick] = h->reserved2;
    dbg_async_last_crc16[pick] = h->crc16;
    
    if(vnd_transmit_frame(sel->buf, sel->frame_len, 0, 0, pick==0?"ADC0-ASY2":"ADC1-ASY2") == USBD_OK){
        /* Учёт статистики предварительно (окончательная фиксация в TxCplt) */
        if(pick==0) dbg_sent_ch0_total++; else dbg_sent_ch1_total++;
        sending_channel = (uint8_t)pick; sel->valid = 0; last_sent_ch = (uint8_t)pick;
        /* Логика продвижения общего seq в async режиме.
           Базово: ждём кадры A и B (seq_mask==0x3) -> инкремент.
           Проблема: если один канал (например B) долго не приходит, мы зацикливаемся на одном seq.
           Решение: fallback по таймауту или числу односторонних кадров. */
        uint32_t now_ms_local = HAL_GetTick();
        if(vnd_ch_mode==2 && vnd_strict_pairing){
            seq_mask |= (uint8_t)(1u<<pick);
            if(seq_mask_first_ms == 0) seq_mask_first_ms = now_ms_local;
            if(seq_mask == 0x3){
                /* Оба канала отправили по кадру текущего seq — продвигаем */
                seq_mask = 0; seq_mask_first_ms = 0; seq_partial_cnt = 0;
                stream_seq++; dbg_produced_seq++;
            } else {
                /* Строгая парность: не продвигаем seq, пока не отправлены оба канала. */
                seq_partial_cnt++;
                uint32_t dt_ms = (now_ms_local >= seq_mask_first_ms) ? (now_ms_local - seq_mask_first_ms) : (0xFFFFFFFFu - seq_mask_first_ms + 1u + now_ms_local);
                if(dt_ms > 1000 && (seq_partial_cnt % 8) == 0){
                    VND_LOG("ASYNC_WAIT_PAIR seq=%lu mask=0x%02X cnt=%u dt=%lums", (unsigned long)stream_seq, (unsigned)seq_mask, (unsigned)seq_partial_cnt, (unsigned long)dt_ms);
                }
            }
        } else if (vnd_ch_mode==2 && !vnd_strict_pairing){
            /* Независимые каналы: продвигаем seq каждый кадр, сохраняя общую временную шкалу */
            stream_seq++; dbg_produced_seq++;
            seq_mask = 0; seq_mask_first_ms = 0; seq_partial_cnt = 0; /* сброс */
        } else {
            /* В режиме single-channel seq просто инкрементируется каждый кадр */
            stream_seq++; dbg_produced_seq++;
            seq_mask = 0; seq_mask_first_ms = 0; seq_partial_cnt = 0; /* сброс */
        }
        /* ПРОФИЛИРОВАНИЕ: успешная отправка */
        uint32_t end_cyc = DWT->CYCCNT;
        uint32_t elapsed_cyc = (end_cyc >= start_cyc) ? (end_cyc - start_cyc) : (0xFFFFFFFFu - start_cyc + end_cyc + 1);
        uint32_t elapsed_us = elapsed_cyc / (SystemCoreClock / 1000000u);
        call_count++;
        total_time_us += elapsed_us;
        if(elapsed_us > max_time_us) max_time_us = elapsed_us;
        
        uint32_t now_profile = HAL_GetTick();
        if(now_profile - last_profile_log >= 5000){
            __attribute__((unused)) uint32_t avg_us = call_count ? (total_time_us / call_count) : 0;
                 VND_PROF_LOGF("[PROF_TX] calls=%lu avg=%lu.%luus max=%lu.%luus\r\n",
                     call_count, avg_us, (elapsed_us%10), max_time_us, (max_time_us%10));
            call_count = 0; total_time_us = 0; max_time_us = 0;
            last_profile_log = now_profile;
        }
        return 1;
    }
    
    /* ПРОФИЛИРОВАНИЕ: не отправлено (нет данных) */
    uint32_t end_cyc = DWT->CYCCNT;
    uint32_t elapsed_cyc = (end_cyc >= start_cyc) ? (end_cyc - start_cyc) : (0xFFFFFFFFu - start_cyc + end_cyc + 1);
    uint32_t elapsed_us = elapsed_cyc / (SystemCoreClock / 1000000u);
    call_count++;
    total_time_us += elapsed_us;
    if(elapsed_us > max_time_us) max_time_us = elapsed_us;
    
