kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
uint32_t vnd_get_last_host_rx_ack_ms(void)
{
    return vnd_last_host_rx_ack_ms;
}

uint32_t vnd_get_last_error(void)
{
    return vnd_last_error;
}

/* Общее число переданных байт (все передачи) */
uint64_t vnd_get_total_tx_bytes(void)
{
    return vnd_total_tx_bytes;
}

/* Общее число переданных сэмплов (оба канала суммарно) */
uint64_t vnd_get_total_tx_samples(void)
{
    return vnd_total_tx_samples;
}

void vnd_log_usb_close_snapshot(const char *reason)
{
    uint32_t now_ms = HAL_GetTick();
    extern uint8_t USBD_VND_TxIsBusy(void);
    extern uint16_t USBD_VND_InTotalLength(void);
    extern uint32_t USBD_VND_DataInCount(void);
    extern volatile uint32_t main_loop_heartbeat;
    extern volatile uint32_t last_heartbeat_ms;
    extern volatile uint32_t loop_cycle_last_avg;
    extern volatile uint32_t g_usb_last_sof_ms;

    uint32_t last_age = 0xFFFFFFFFu;
    uint32_t frame_age = 0xFFFFFFFFu;
    uint32_t tx_age = 0xFFFFFFFFu;
    uint32_t host_rx_age = 0xFFFFFFFFu;
    uint32_t hb_age = 0xFFFFFFFFu;
    uint32_t sof_age = 0xFFFFFFFFu;
    uint32_t force_idle_age = 0xFFFFFFFFu;
    (void)vnd_tick_age_ms(now_ms, vnd_last_txcplt_ms, &last_age);
    (void)vnd_tick_age_ms(now_ms, vnd_last_frame_txcplt_ms, &frame_age);
    (void)vnd_tick_age_ms(now_ms, vnd_last_tx_start_ms, &tx_age);
    (void)vnd_tick_age_ms(now_ms, vnd_last_host_rx_ack_ms, &host_rx_age);
    (void)vnd_tick_age_ms(now_ms, last_heartbeat_ms, &hb_age);
    (void)vnd_tick_age_ms(now_ms, g_usb_last_sof_ms, &sof_age);
    (void)vnd_tick_age_ms(now_ms, dbg_tx_force_idle_last_ms, &force_idle_age);

    adc_stream_debug_t dbg;
    adc_stream_get_debug(&dbg);
    const char *stA = (g_frames[0][0].st==FB_READY?"READY":(g_frames[0][0].st==FB_SENDING?"SENDING":"FILL"));
    const char *stB = (g_frames[0][1].st==FB_READY?"READY":(g_frames[0][1].st==FB_SENDING?"SENDING":"FILL"));

    printf("[USB_CLOSE_SNAPSHOT] reason=%s t=%lu stream=%u active=%u mode=%u async=%u ch=%u ep=%u ll=%u infl=%u pendB=%u sendch=%u meta=%u q=%u err=%lu kick=%u last=%lu frame=%lu txage=%lu len=%u tl=%u din=%lu rxage=%lu rx=%lu txcplt=%lu A=%lu B=%lu wr=%lu rd=%lu avg=%lu/%lu/%lu force=%lu/%lu drop=%lu/%lu hb=%lu hbage=%lu sof=%lu loop=%lu dma=%lu/%lu A_st=%s B_st=%s\r\n",
           reason ? reason : "?",
           (unsigned long)now_ms,
           (unsigned)streaming,
           (unsigned)vnd_stream_active,
           (unsigned)vnd_stream_mode,
           (unsigned)async_mode,
           (unsigned)vnd_ch_mode,
           (unsigned)vnd_ep_busy,
           (unsigned)USBD_VND_TxIsBusy(),
           (unsigned)vnd_inflight,
           (unsigned)pending_B,
           (unsigned)sending_channel,
           (unsigned)vnd_tx_meta_depth(),
           (unsigned)vnd_avg_q_count,
           (unsigned long)vnd_last_error,
           (unsigned)vnd_tx_kick,
           (unsigned long)last_age,
           (unsigned long)frame_age,
           (unsigned long)tx_age,
           (unsigned)vnd_last_tx_len,
           (unsigned)USBD_VND_InTotalLength(),
           (unsigned long)USBD_VND_DataInCount(),
           (unsigned long)host_rx_age,
           (unsigned long)vnd_host_rx_last_counter,
           (unsigned long)dbg_tx_cplt,
           (unsigned long)dbg_sent_ch0_total,
           (unsigned long)dbg_sent_ch1_total,
           (unsigned long)frame_wr_seq,
           (unsigned long)frame_rd_seq,
           (unsigned long)dbg_avg_in_frames,
           (unsigned long)dbg_avg_out_frames,
           (unsigned long)dbg_avg_tx_pairs,
           (unsigned long)dbg_tx_force_idle_count,
           (unsigned long)force_idle_age,
           (unsigned long)dbg_tx_drop_recovery_count,
           (unsigned long)dbg_tx_drop_recovery_request_count,
           (unsigned long)main_loop_heartbeat,
           (unsigned long)hb_age,
           (unsigned long)sof_age,
           (unsigned long)loop_cycle_last_avg,
           (unsigned long)dbg.dma_full0,
           (unsigned long)dbg.dma_full1,
           stA,
           stB);
}

void Vendor_ChangeEvent_DiagPrint(void)
{
    uint32_t now_ms = HAL_GetTick();
    uint32_t enqueue_age_ms = 0xFFFFFFFFu;
    int32_t next_tx_in_ms = 0;

    if(vnd_event_last_enqueue_ms != 0u){
        (void)vnd_tick_age_ms(now_ms, vnd_event_last_enqueue_ms, &enqueue_age_ms);
    }
    if(vnd_event_next_tx_ms != 0u){
        next_tx_in_ms = (int32_t)(vnd_event_next_tx_ms - now_ms);
        if(next_tx_in_ms < 0){
            next_tx_in_ms = 0;
        }
    }

    printf("[EVT1] q=%u head=%u tail=%u seq=%lu enq=%lu tx_try=%lu tx_ok=%lu tx_fail=%lu tx_defer=%lu tx_cplt=%lu drop=%lu\r\n",
           (unsigned)vnd_event_count,
           (unsigned)vnd_event_head,
           (unsigned)vnd_event_tail,
           (unsigned long)vnd_event_seq,
           (unsigned long)dbg_event_enqueued,
           (unsigned long)dbg_event_tx_attempt,
           (unsigned long)dbg_event_tx_ok,
           (unsigned long)dbg_event_tx_fail,
           (unsigned long)dbg_event_tx_defer,
           (unsigned long)dbg_event_tx_cplt,
           (unsigned long)dbg_event_dropped);
    printf("[EVT1] last_enq=0x%02X last_tx=0x%02X last_cplt=0x%02X infl=0x%02X infl_len=%u last_age=%lu ms next_tx_in=%ld ms\r\n",
           (unsigned)dbg_event_last_enqueue_type,
           (unsigned)dbg_event_last_tx_type,
           (unsigned)dbg_event_last_cplt_type,
           (unsigned)vnd_event_inflight_type,
           (unsigned)vnd_event_inflight_len,
           (unsigned long)enqueue_age_ms,
           (long)next_tx_in_ms);
    printf("[EVT1] stream=%u active=%u first_pair=%u pendingB=%u send_ch=%u ep_busy=%u inflight=%u tx_kick=%u mode=%u async=%u full=%u\r\n",
           (unsigned)streaming,
           (unsigned)vnd_stream_active,
           (unsigned)first_pair_done,
           (unsigned)pending_B,
           (unsigned)sending_channel,
           (unsigned)vnd_ep_busy,
           (unsigned)vnd_inflight,
           (unsigned)vnd_tx_kick,
           (unsigned)vnd_stream_mode,
           (unsigned)async_mode,
           (unsigned)full_mode);
}

void Vendor_StreamDiagPrint(void)
{
    adc_stream_debug_t d;
    memset(&d, 0, sizeof(d));
    adc_stream_get_debug(&d);

    extern uint8_t USBD_VND_TxIsBusy(void);
    uint8_t ll_busy = USBD_VND_TxIsBusy();

    vnd_log_usb_close_snapshot("UART_VND");
    printf("[VNDSTR] stream=%u active=%u mode=%u full=%u async=%u ch=%u samples=%u req=%u frame=%u ep=%u ll=%u infl=%u tx_ready=%u txcplt=%lu crc_fin=%lu crc_last=0x%04X\r\n",
           (unsigned)streaming,
           (unsigned)vnd_stream_active,
           (unsigned)vnd_stream_mode,
           (unsigned)full_mode,
           (unsigned)async_mode,
           (unsigned)vnd_ch_mode,
           (unsigned)cur_samples_per_frame,
           (unsigned)vnd_frame_samples_req,
           (unsigned)cur_expected_frame_size,
           (unsigned)vnd_ep_busy,
           (unsigned)ll_busy,
           (unsigned)vnd_inflight,
           (unsigned)vnd_tx_ready,
           (unsigned long)dbg_tx_cplt,
           (unsigned long)dbg_frame_crc_finalized,
           (unsigned)dbg_frame_crc_last);
    printf("[VNDSTR] adc wr=%lu/%lu rd=%lu/%lu drops=%lu/%lu adc_pause=%u pause_events=%lu fifo=%u\r\n",
           (unsigned long)d.ch_wr_seq[0],
           (unsigned long)d.ch_wr_seq[1],
           (unsigned long)d.ch_rd_seq[0],
           (unsigned long)d.ch_rd_seq[1],
           (unsigned long)d.ch_overflow_drops[0],
           (unsigned long)d.ch_overflow_drops[1],
           (unsigned)adc_stream_paused,
           (unsigned long)adc_stream_pause_events,
           (unsigned)FIFO_FRAMES);
    printf("[VNDSTR] avg n=%u q=%u cnt=%u/%u in=%lu out=%lu tx_pairs=%lu drop=%lu min=%u max=%u pace_active=%u\r\n",
           (unsigned)vnd_avg_n,
           (unsigned)vnd_avg_q_count,
           (unsigned)vnd_avg_cnt[0],
           (unsigned)vnd_avg_cnt[1],
           (unsigned long)dbg_avg_in_frames,
           (unsigned long)dbg_avg_out_frames,
           (unsigned long)dbg_avg_tx_pairs,
           (unsigned long)dbg_avg_drop_frames,
           (unsigned)VND_AVG_MIN_N,
           (unsigned)VND_AVG_MAX_N,
           (unsigned)vnd_frame_pace_applies());
    for(uint8_t ch = 0u; ch < 2u; ch++){
        uint32_t age_ms = 0xFFFFFFFFu;
        if(dbg_async_last_ms[ch] != 0u){
            (void)vnd_tick_age_ms(HAL_GetTick(), dbg_async_last_ms[ch], &age_ms);
        }
        printf("[VNDSTR] ch%u snap=%lu gen_move=%lu fifo_guard=%lu cons_ok=%lu cons_fail=%lu last_seq=%lu slot=%lu samples=%u wr=%lu->%lu rd=%lu->%lu r2=0x%04X crc=0x%04X age=%lu\r\n",
               (unsigned)ch,
               (unsigned long)dbg_async_snapshot_copies[ch],
               (unsigned long)dbg_async_snapshot_gen_move[ch],
               (unsigned long)dbg_async_snapshot_fifo_guard[ch],
               (unsigned long)dbg_async_consume_ok[ch],
               (unsigned long)dbg_async_consume_fail[ch],
               (unsigned long)dbg_async_last_dma_seq[ch],
               (unsigned long)(dbg_async_last_dma_seq[ch] % (uint32_t)FIFO_FRAMES),
               (unsigned)dbg_async_last_samples[ch],
               (unsigned long)dbg_async_last_wr_before[ch],
               (unsigned long)dbg_async_last_wr_after[ch],
               (unsigned long)dbg_async_last_rd_before[ch],
               (unsigned long)dbg_async_last_rd_after[ch],
               (unsigned)dbg_async_last_reserved2[ch],
               (unsigned)dbg_async_last_crc16[ch],
               (unsigned long)age_ms);
    }
    printf("[VNDSTR] reserved2 bits: 0..2=buffer_index 3..7=source_slot 8=snapshot 9=gen_changed 10=fifo_guard 11=consume_ok 12..15=txcplt_lsb\r\n");
    printf("[VNDSTR] event q=%u enq=%lu tx_ok=%lu tx_cplt=%lu drop=%lu\r\n",
           (unsigned)vnd_event_count,
           (unsigned long)dbg_event_enqueued,
           (unsigned long)dbg_event_tx_ok,
           (unsigned long)dbg_event_tx_cplt,
           (unsigned long)dbg_event_dropped);
}

